{"chunks": ["八字命理\n命理基础知识输入\n五行、五行性、阴阳五行、五行相生、五行相克、五行反生、五行反克。\n阴阳---意义广泛,万事万物都可分出阴阳，如阴为月亮、黑暗、地、夜、女、柔、弱、静、泄、耗、冬季、偶数等。阳为太阳、光明、天、昼、男、刚、强、旺、动、生、克、夏季、奇数等。阴阳之理不是一成不变的，阴中也包含着阳，阳中也包含着阴，当事物发展到极端之时，阴阳开始转换，也就是阳极必阴，阴极必阳之理。\n五行——指金、水、木、火、土。金性主清静肃杀，水主寒冷向下，木主生发豁达，火主炎热向上，土主生长养化育等。\n五行相生——木生火，火生土，土生金，金生水，水生木\n五行相克——木克土，土克水，水克火，火克金，金克木\n五行反生——金赖土生，土多金埋。土赖火生，火多土焦。火赖木生，木多火炽。木赖水生，水多木漂。水赖金生，金多水浊\n五行反克——金能克木，木旺金缺。木能克土，土重木折。土能克水，水多土流。水能克火，火多水灼。火能克金，金多火熄\n干支符号、六十甲子\n干支符号：十天干和十二地支\n天干：甲乙丙丁戊己庚辛壬癸\n地支：子丑寅卯辰巳午未申酉戌亥\n\n六十甲子\n| 甲子 | 乙丑 | 丙寅 | 丁卯 | 戊辰 | 己巳 | 庚午 | 辛未 | 壬申 | 癸酉 |\n| 甲戌 | 乙亥 | 丙子 | 丁丑 | 戊寅 | 己卯 | 庚辰 | 辛巳 | 壬午 | 癸未 |\n| 甲申 | 乙酉 | 丙戌 | 丁亥 | 戊子 | 己丑 | 庚寅 | 辛卯 | 壬辰 | 癸巳 |\n| 甲午 | 乙未 | 丙申 | 丁酉 | 戊戌 | 己亥 | 庚子 | 辛丑 | 壬寅 | 癸卯 |\n| 甲辰 | 乙巳 | 丙午 | 丁未", "申 | 乙酉 | 丙戌 | 丁亥 | 戊子 | 己丑 | 庚寅 | 辛卯 | 壬辰 | 癸巳 |\n| 甲午 | 乙未 | 丙申 | 丁酉 | 戊戌 | 己亥 | 庚子 | 辛丑 | 壬寅 | 癸卯 |\n| 甲辰 | 乙巳 | 丙午 | 丁未 | 戊申 | 己酉 | 庚戌 | 辛亥 | 壬子 | 癸丑 |\n| 甲寅 | 乙卯 | 丙辰 | 丁巳 | 戊午 | 己未 | 庚申 | 辛酉 | 壬戌 | 癸亥 |\n\n\n\n干支符号十二节气与时辰关系\n十二节气\n\n\n人元司令\n\n十二时辰\n\n\n十天干、天干阴阳、天干特性。\n\n十二地支、地支阴阳、地支藏根。\n\n\n十二地支藏根\n\n寻根基找出处\n甲木​​：寅、卯、未、辰、亥（气）\n​​乙木​​：卯、寅、未、辰、亥（气）\n​​丙火​​：巳、午、戌、未、寅（气）\n​​丁火​​：午、巳、戌、未、寅（气）\n​​戊土​​：巳、午、戌、未、寅（气）、申（气）、辰（作为根基需要火旺）、丑（作为根基需要火旺）\n​​己土​​：午、未、戌、丑、寅（气）、申（气）、辰（作为根基需要火旺）、丑（作为根基需要火旺）\n​​庚金​​：申、酉、丑、戌、巳（气）\n​​辛金​​：酉、申、丑、戌、巳（气）\n​​壬水​​：亥、子、辰、丑、申（气）\n​​癸水​​：子、亥、辰、丑、申（气）\n规则​​：\n木火金水在四墓库中有藏根可算根基和出处\n四驿马为长生之地，为气不能算根基和出处，根基为实，气为虚\n若辰、丑的天干为火（丙/丁）或原局火旺，辰丑可作戊己土根基；若辰、丑的天干为金（庚/辛）或水（壬/癸），则辰丑非戊己土根基。\n\n\n四墓库\n辰戌丑未为四墓库\n库有三气\n辰本气为土，库气为水，余气为木", "地，为气不能算根基和出处，根基为实，气为虚\n若辰、丑的天干为火（丙/丁）或原局火旺，辰丑可作戊己土根基；若辰、丑的天干为金（庚/辛）或水（壬/癸），则辰丑非戊己土根基。\n\n\n四墓库\n辰戌丑未为四墓库\n库有三气\n辰本气为土，库气为水，余气为木\n戌本气为徒，库气为火，余气为金\n未本气为土，库气为木，余气为火\n丑本气为土，库气未金，余气为水\n对一个命局来说，本气为用为常态，库气为用为强态，余气为用为病态\n戌墓库\n戌是火墓，也为火库\n戌是砖，歌舞厅，庙，窑门，熔炉冶炼，房地产，化学化工，可以理解为带火的熔炉，原材料，机器\n戌土不生金，秋天除外，戌土生活，戌为燥土，未旺土\n命中有午戌，午戌为半合的关系，戌中辛金受伤极其严重\n命中有寅戌，因为寅是火的长生，戌是火的墓库，可以看做寅从戌中出，也可以看作成寅入戌墓\n原局中有寅午戌，强化火的力量，严重克伤寅的力量，寅午戌伤寅，寅在命局中代表的身体部位、六亲、十神对应的事情容易出对应的灾祸\n寅戌为拱合的关系，拱出了午火，开了火库\n午戌为半合的关系，午火生了戌，同时午戌又合化了火，同时增强了火和土的力量\n巳和午同时与戌出现，午不入墓，巳火入墓，巳火所代表的身体部位、六亲、十神对应的事物有灾\n卯戌为六合的关系，也为闭库\n辰与戌是冲的关系，是辰冲戌，而不是戌冲辰，是辰中的癸水克坏戌中的丁火，如有双戌同现，则是辰中的水被双丁克坏\n丑戌为刑的关系，戌中的丁火刑坏丑中的辛金，辛金代表的事物会有伤痕，特殊情况：如在冬月，是丑刑戌，为丑中的癸水刑坏戌中的丁火，春天刑坏丑中的辛金，夏天刑坏丑中的癸水\n丑未为冲的关系，也为丑中的金克制未中的乙木，除非双未出现则刑坏丑中", "双丁克坏\n丑戌为刑的关系，戌中的丁火刑坏丑中的辛金，辛金代表的事物会有伤痕，特殊情况：如在冬月，是丑刑戌，为丑中的癸水刑坏戌中的丁火，春天刑坏丑中的辛金，夏天刑坏丑中的癸水\n丑未为冲的关系，也为丑中的金克制未中的乙木，除非双未出现则刑坏丑中辛金，此外皆为丑中的金克制未中的乙木；丑未也为开库的关系\n酉戌是相穿的关系，是戌穿坏酉金，如甲戌日主女命命中有酉，一般老公能力很差，疾病，严重夭亡\n戌和申之间没有作用关系，不论\n戌与未是刑的关系，是未中丁火刑坏戌中辛金，戌中辛金受伤最严重，耗的是未中的乙木\n\n丑墓库\n丑是金的墓库，代表阴暗，阴湿，黑社会，走私，煤矿，矿产资源\n丑晦火的力度相当大，晦就是让对方受伤、难过的意思\n丑是神秘之星，代表玄学，通灵之物\n酉金与丑是半合的关系，不为入墓\n巳酉丑三合金受伤最大的是巳火，巳火在命局中代表的身体部位、六亲、十神对应的事物三者必出严重的灾祸\n申酉丑同现，申金会入丑墓\n巳丑是拱库的关系，也为半合，但是丑土会晦巳火\n丑与子合，为闭丑库，丑封闭，生在冬天子丑和会水，生在夏天丑土会克坏子水\n丑戌为刑的关系，戌中的丁火刑坏丑中的辛金，辛金代表的事物会有伤损，特殊情况：如在冬月，是丑刑戌，为丑中癸水刑坏戌中的丁火，春天戌刑坏丑中的辛金，夏天刑坏丑中的癸水\n丑未为冲的关系，也为丑中的辛金克制未中的乙木，除非双未出现则刑坏丑中辛金，此外皆为丑中的金克制未中的乙木；丑未也为开库的关系\n丑与寅是暗合的关系，丑中的己癸辛和寅中的甲丙戊，寅丑合未深度之合\n丑与午是穿中带晦的关系，秋天冬天坏的是午火，春天夏天坏掉的是丑中的辛金和癸水\n丑与亥在夏天春天秋天是一种克制关系，冬天", "金，此外皆为丑中的金克制未中的乙木；丑未也为开库的关系\n丑与寅是暗合的关系，丑中的己癸辛和寅中的甲丙戊，寅丑合未深度之合\n丑与午是穿中带晦的关系，秋天冬天坏的是午火，春天夏天坏掉的是丑中的辛金和癸水\n丑与亥在夏天春天秋天是一种克制关系，冬天亥子丑月是一种半会的关系\n巳酉丑三合是强化金的力量，消耗土的力量\n\n未墓库\n未为木的墓库，是燥土，未是木苗，医药，副食，豆芽，一切花草，农作物的基础，未是农药，是吃的东西\n命局中有寅未，寅入未墓，也可以理解为未墓寅\n卯与未部位入墓，未半合的关系，但是卯木会克制未中的己土\n命局中有亥未为半合，亥是木的长生，未是木的墓库，亥未拱出木，但是会消耗未得力量和亥水的力量\n丑未为冲的关系，也为丑中的金克制未中的乙木，除非双未出现则坏丑中的辛金，此外皆为丑中的金克制未中的乙木；丑未也为开库的关系\n亥卯未三合是强化木的力量，破坏亥水的力量，同时也伤害未的力量\n未戌是刑的关系，都会强化火的力量，都倾向于克戌中辛金，泄耗未中的木，辛金有大灾，乙木有小灾，火得到生助\n子穿未是想穿的关系，夏天穿坏子水，冬天穿坏未中丁火\n午未是合化火的关系，午也闭了木库，午未合作用不大\n未土不生酉金，反而脆金\n\n辰墓库\n辰时水的墓库，辰是中草药，水库，池塘，教育部门，辰代表庙宇，也代表学校，也有黑社会之像\n*辰未比劫库、官杀库容易干黑暗的事情，辰为食伤库、印库容易干学校的事情\n2、申辰是半合，拱出子水\n3、子辰是半合，不为子水入墓\n4、命中有亥子辰，亥入辰墓，子不入\n5、辰辰为自刑的关系，矛盾、纠结，也代表六亲不靠，情感缺失\n6、辰戌为冲的关系，是辰中的癸水冲坏戌中的丁火，夏天戌可以", "食伤库、印库容易干学校的事情\n2、申辰是半合，拱出子水\n3、子辰是半合，不为子水入墓\n4、命中有亥子辰，亥入辰墓，子不入\n5、辰辰为自刑的关系，矛盾、纠结，也代表六亲不靠，情感缺失\n6、辰戌为冲的关系，是辰中的癸水冲坏戌中的丁火，夏天戌可以冲坏辰中的癸水，或双戌同现也会冲坏辰中癸水，其他情况则不行\n7、辰酉是闭库的关系，酉金克坏辰中乙木，乙木所代表的身体部位、六亲、十神对应的事物受伤\n8、丑是入辰墓的关系\n9、未是入辰墓的关系，但是丑未同时出现为丑未冲，不入辰墓\n10、卯辰是穿的关系，坏辰中乙木\n11、申子辰三合，生助子水的力量，消耗申金，申金代表的身体部位、六亲、十神对应的事物大凶\n12、寅卯辰是三会木的关系，土气化尽，水气耗尽，木极旺\n13、巳午未是三会火的关系，火土都得力，不化尽\n14、亥子丑是三会水的关系，土耗尽，金泄尽，水极旺\n15、申酉戌是三会金的关系，土泄尽，火受伤，金极旺\n四墓库何时为库，何时为墓：忌神要入之时为库，喜神要入之时为墓；喜申入墓应灾，忌神入库应吉\n入墓的条件：\n伤而入墓（穿刑绝破）\n多而入墓（多现）\n五墓应事\n官杀库入墓：丢官罢职、公司倒闭或者离职跳槽、牢狱、女命伤夫亡夫\n 食伤库入墓：女命容易堕胎、神经脑子不正常、牢狱、慢性病\n财星入墓：伤父父亲有病或者有灾、财星入比劫墓主破财、容易被人借钱骗钱、男命伤妻妻子有病或者有灾\n比劫入墓：兄弟能力不行、兄弟有灾、兄弟牢狱之像\n5、印星入墓：伤母母亲身体不好或者早逝、抑郁、有点神经、牢狱\n五库应事\n官杀库：主控制力、权利、管理能力、领导力、当官掌权\n食伤库：主才华、技术、子女、想法、投资\n比劫库：主兄弟、", "病或者有灾\n比劫入墓：兄弟能力不行、兄弟有灾、兄弟牢狱之像\n5、印星入墓：伤母母亲身体不好或者早逝、抑郁、有点神经、牢狱\n五库应事\n官杀库：主控制力、权利、管理能力、领导力、当官掌权\n食伤库：主才华、技术、子女、想法、投资\n比劫库：主兄弟、朋友、义气、拉帮结派、黑社会、军队、军警\n财星库：主财富、女人、欲望、野心\n印绶库：主记忆力、名气、贵人、房产、土地\n开库方式\n冲开：最直接效率高的方式——辰戌冲、丑未冲\n刑开：一般用特殊手段、非法手段，也代表容易有后遗症、六亲伤克或自身有疾病——丑戌刑、未戌刑\n拱开：慢，辛苦，劳碌，干得多收获少，需要靠自己\n申辰拱开辰水库、亥未拱开木库、己丑拱开丑金库、寅戌拱开戌火库\n干透自开，天干出现库中之物为自动开库\n支中自现，地支出现库中之物为自动开库\n\n天干五合，地支六合。\n天干五合——指天干而言，如甲与己合，乙与庚合，丙与辛合，戊与癸合，丁与壬合。\n地支六合——指地支而言，如子与丑合，卯与戌合，辰与酉合，午与未合，寅与亥合，巳与申合\n争合——指天干而言，如两干争合一干，三干争合一干等。\n合化——命局中如有两种五行相对，又有出来通关调解之五行，使两神化敌为友，使克变生。日主弱官煞旺，取印化官煞者谓之化。合者，乃三合、六合、干合、支合是也，如亥卯未合成木局，寅午戌合成火局等叫做三合局，谓之三合。地支子与丑合，寅与亥合……谓之六合。天干丙与辛合化水，丁与壬合化木……谓之天干之合。又如地支子与丑合化土，寅与亥合化木之类。\n\n旺相休囚死和十二长生\n旺相休囚死，代表不同四时不同五行的力量大小，当令者为旺，旺生者为相\n\n\n十二长生\n\n五行和天干地支对应的五脏六", "合……谓之六合。天干丙与辛合化水，丁与壬合化木……谓之天干之合。又如地支子与丑合化土，寅与亥合化木之类。\n\n旺相休囚死和十二长生\n旺相休囚死，代表不同四时不同五行的力量大小，当令者为旺，旺生者为相\n\n\n十二长生\n\n五行和天干地支对应的五脏六腑，身体各类器官。\n\n\n\n\n十神系统\n十神：日干与其他成分的阴阳五行之间关系的代称\n正官、偏官（七杀）、正财、偏财、正印、偏印、伤官、食神、比肩、劫财\n\n\n十神生克制化\n正偏印生比肩劫财，比肩、劫财生伤官、食神，伤官、食神生正偏财，正偏财生正官、七杀，正官、七杀生正偏印；\n正偏印克伤官、食神，比肩劫财克正偏财，伤官、食神克正官、七杀，正偏财克正偏印，正官七杀克比肩、劫财；\n同阴阳十神克制力度大，不同阴阳十神生化力度大\n\n十神六亲关系\n男命\n偏财为父、妾，正财为妻，正印为母，偏印为偏母、祖父，正官为女，七杀为儿，伤官为孙子、祖母，食神为孙女，比肩劫财为兄弟姐妹\n女命\n偏财为父，正财为婆婆，正印为母，偏印为偏母，正官为丈夫，七杀为偏父，伤官为儿子，食神为女儿，比肩劫财为兄弟姐妹\n\n十神代表社会属性\n比肩劫财为同辈、竞争对手，伤官、食神为技术、聪明才华，正财、偏财为财、财产，正官、偏官为官位权利，正印、偏印为声望、证书、房产。\n三合，三会，半合，六合，暗合，刑冲破害穿绝。\n\n地支三刑，自刑：\n丑未戌三刑，寅巳申三刑，亥亥自刑，午午自刑，酉酉自刑，辰辰自刑\n地支六穿（害）：子未穿（严重），丑午穿（严重），申亥穿，寅巳穿，卯辰穿，酉戌穿\n地支六破：子酉破，卯午破，丑辰破，未戌破，寅亥破，巳申破（子卯，未戌刑中带破，寅亥，巳申合中带破）\n地支暗合：寅丑暗", "刑，亥亥自刑，午午自刑，酉酉自刑，辰辰自刑\n地支六穿（害）：子未穿（严重），丑午穿（严重），申亥穿，寅巳穿，卯辰穿，酉戌穿\n地支六破：子酉破，卯午破，丑辰破，未戌破，寅亥破，巳申破（子卯，未戌刑中带破，寅亥，巳申合中带破）\n地支暗合：寅丑暗合，巳酉暗合，午亥暗合，子巳暗合\n绝：互绝，开始合好，后来互相伤害，老死不相往来\n子绝于巳，卯绝于申，寅绝于酉，午绝于亥\n\n伏吟，双冲，双合（天干地支）。\n\n\n神煞系统\n\n\n\n\n\n\n\n\n\n\n十天干、十二地支取像\n十天干取像\n\n甲木为雷为大树，栋梁电杆与高楼；神位公门及首领，高贵宽仁与磊落；\n乙木为风为花草，庄稼花园及栏杆；毛笔织物和手作，儒雅柔情与仁慈；\n丙火太阳为影视，权力名气与电器；书画演说和装饰，正面多言与激情；\n丁火星星为报纸，医道玄学及宗教；色彩名誉和网络，文雅神秘带智慧；\n戊土为霞为山丘，仓库公门建筑物；古董涂料收藏品，忠厚老成慢性子；\n己土为云为平原，墓地房屋农牧业；粉尘建材和果实，含蓄谨慎心多疑；\n庚金为霜为矿物，五金制造军警杀；车路医院金融业，刚强威武与暴躁；\n辛金为月为珠宝，法律医药精加工；晶体乐器钱币笔，柔润灵动好面子；\n壬水云海为江河，运输贸易水产业；浴业石油与水彩，智谋好动韧性强；\n癸水雨露为泉水，霜雪结晶滴眼泪；玄学文墨在后面，谋略机敏很温柔；\n十二地支取像\n子水流动是江湖，车船贸易和文墨；泉水井冰与圆润，聪明技能多淫邪；\n丑土寒土是煤矿，坟墓牢狱黑社会；沼泽厕所下水道，私情淫乱与玄学；\n寅木山林造家具，神龛寺庙和高雅；楼宇组织与会所，带印公门文化场；\n卯木花草和篱笆，车船街道与兵器；网络织物及绳索，机构建材床门窗", "贸易和文墨；泉水井冰与圆润，聪明技能多淫邪；\n丑土寒土是煤矿，坟墓牢狱黑社会；沼泽厕所下水道，私情淫乱与玄学；\n寅木山林造家具，神龛寺庙和高雅；楼宇组织与会所，带印公门文化场；\n卯木花草和篱笆，车船街道与兵器；网络织物及绳索，机构建材床门窗；\n辰土湿泥为水库，车辆机器大机构；旧物中药田园地，牢狱网络和思想；\n已火色彩多变化，文化思想和影像；道路楼台及闹市，寺观务虚与温暖；\n午火阳光来去直，大热打杀在战场；冶炼信息及广告，热闹激动体育场；\n未土暖土是林场，医药化工酒店食；休闲饰物在田园，热毒营造建筑物；\n申金道路有车辆，兵戈军队公检法；名都祠堂与医院，数学金融矿物厂；\n西金银行和钟表，传媒街道与玄学；法律技术及机巧，奸邪寺院隐学妓；\n戌土燥土枪弹库，坟狱文明编辑部；闹市色情加油站，数学化工互联网；\n亥水池塘文笔墨，心志沟通水产业；运算科技与思想，毒药沉溺在酒中。\n排盘\n  年柱&日柱\n查万年历\n\n推月柱：\n月柱地支：查万年历，排八字四柱需要严格按节气划分，尤其月柱地支\n 月柱天干：五虎遁年起月诀\n甲己之年丙作首，乙庚之岁戊为头，\n丙辛岁首寻庚起，丁壬壬位顺行流，\n若言戊癸何方发，甲寅之上好追求。\n今译：\n如果年干是甲或己，那么月的天干就是以丙为寅月、丁为卯月，依次类推；\n如果年干是乙或庚，那么月的天干就是以戊作寅月、己作卯月，依次类推；\n如果年干是丙或辛，那么月的天干就是以庚作寅月、辛作卯月，依次类推；\n如果年干是丁或壬，那么月的天干就是以壬作寅月、癸作卯月，依次类推；\n如果年干是戊或癸，那么月的天干就是以甲作寅月、乙作卯月，依次类推。\n这五对年干仍是天干五合中那五对，其所对应的", "干是丙或辛，那么月的天干就是以庚作寅月、辛作卯月，依次类推；\n如果年干是丁或壬，那么月的天干就是以壬作寅月、癸作卯月，依次类推；\n如果年干是戊或癸，那么月的天干就是以甲作寅月、乙作卯月，依次类推。\n这五对年干仍是天干五合中那五对，其所对应的起月天干依次为：丙戊庚壬甲，这些都是阳天干。\n“五虎遁年起月诀”之所以被称为“五虎遁”，是因为全部以“寅”打头来排列的，寅为虎，所以称之为五虎遁。\n\n推时柱：\n时柱地支：严格按十二时辰表，尤其需要区分早子时和晚子时\n时柱天干：五鼠遁日起时诀\n甲己还加甲，乙庚丙作初，\n丙辛从戊起，丁壬庚子居，\n戊癸何方发，壬子是真途。\n今译：\n如果日干是甲或己，那么时柱的天干即是以甲为子时、乙为丑时，依次类推；\n如果日干是乙或庚，那么时柱的天干即是以丙作子时、丁作丑时，依次类推；\n如果日干是丙或辛，那么时柱的天干即是以戊作子时、己作丑时，依次类推；\n如果日干是丁或壬，那么时柱的天干即是以庚作子时、辛作丑时，依次类推；\n如果日干是戊或癸，那么时柱的天干即是以壬作子时、癸作丑时，依次类推。\n而这五对日干也是天干五合中那五对，其所对应的起时天干依次为五个阳天干，即：甲丙戊庚壬。\n“五鼠遁日起时诀”之所以被称为“五鼠遁”，是因为全部以“子”时打头来排列的，子为鼠，所以称之为五鼠遁。\n\n排大运&起大运\n四柱八字起运规则：\n年柱天干为甲、丙、戊、庚、壬，是阳干，男命从月柱顺排，起大运以所生之日顺数至本节气结束。\n年柱天干为甲、丙、戊、庚、壬，是阳干，女命从月柱逆排，起大运以所生之日逆数至本节气开始节点。\n年柱天干为乙、丁、己、辛、癸，是阴干，女命从月柱顺排，起大运以所生之", "、丙、戊、庚、壬，是阳干，男命从月柱顺排，起大运以所生之日顺数至本节气结束。\n年柱天干为甲、丙、戊、庚、壬，是阳干，女命从月柱逆排，起大运以所生之日逆数至本节气开始节点。\n年柱天干为乙、丁、己、辛、癸，是阴干，女命从月柱顺排，起大运以所生之日顺数至本节气结束。\n年柱天干为乙、丁、己、辛、癸，是阴干，男命从月柱逆排，起大运以所生之日逆数至本节气开始节点。\n起运数的起法：以1天折合4个月,2天折合8个月，3天折合1年计。计算时，如起运总数为18天，18除3等于6，就是6年，即为6岁起大运；起运总数不能被3整除时，多一天，即起运总数为19天，按6岁零4个月计，或只按6岁计，多两天，即运总数为20天，按6岁零8个月计，或按余一按七岁计。\n特殊场景处理：\n1．跨节气争议\n若出生在节气交接日（如清明当日），需用真太阳时确认所属月份\n2. 非整天数处理\n如天数=25天：25/3=8.33年，务实中可按余1按9岁计算\n\n一、男命大运排法\n1. 年干为阳（甲、丙、戊、庚、壬）：顺排大运\n出生节气月\t大运排列方向\n立春月（寅月）\t顺数至惊蛰月（卯月开始）\n惊蛰月（卯月）\t顺数至清明月（辰月开始）\n清明月（辰月）\t顺数至立夏月（巳月开始）\n立夏月（巳月）\t顺数至芒种月（午月开始）\n芒种月（午月）\t顺数至小暑月（未月开始）\n小暑月（未月）\t顺数至立秋月（申月开始）\n立秋月（申月）\t顺数至白露月（酉月开始）\n白露月（酉月）\t顺数至寒露月（戌月开始）\n寒露月（戌月）\t顺数至立冬月（亥月开始）\n立冬月（亥月）\t顺数至大雪月（子月开始）\n大雪月（子月）\t顺数至小寒月（丑月开始）\n小寒月（丑月）\t顺数至立春月（", "立秋月（申月）\t顺数至白露月（酉月开始）\n白露月（酉月）\t顺数至寒露月（戌月开始）\n寒露月（戌月）\t顺数至立冬月（亥月开始）\n立冬月（亥月）\t顺数至大雪月（子月开始）\n大雪月（子月）\t顺数至小寒月（丑月开始）\n小寒月（丑月）\t顺数至立春月（寅月开始）\n2. 年干为阴（乙、丁、己、辛、癸）：逆排大运\n出生节气月\t大运排列方向\n立春月（寅月）\t逆数至立春月（寅月开始）\n惊蛰月（卯月）\t逆数至惊蛰月（卯月开始）\n清明月（辰月）\t逆数至清明月（辰月开始）\n立夏月（巳月）\t逆数至立夏月（巳月开始）\n芒种月（午月）\t逆数至芒种月（午月开始）\n小暑月（未月）\t逆数至小暑月（未月开始）\n立秋月（申月）\t逆数至立秋月（申月开始）\n白露月（酉月）\t逆数至白露月（酉月开始）\n寒露月（戌月）\t逆数至寒露月（戌月开始）\n立冬月（亥月）\t逆数至立冬月（亥月开始）\n大雪月（子月）\t逆数至大雪月（子月开始）\n小寒月（丑月）\t逆数至大雪月（子月开始）\n________________________________________\n二、女命大运排法\n1. 年干为阴（乙、丁、己、辛、癸）：顺排大运\n出生节气月\t大运排列方向\n立春月（寅月）\t顺数至惊蛰月（卯月开始）\n惊蛰月（卯月）\t顺数至清明月（辰月开始）\n清明月（辰月）\t顺数至立夏月（巳月开始）\n立夏月（巳月）\t顺数至芒种月（午月开始）\n芒种月（午月）\t顺数至小暑月（未月开始）\n小暑月（未月）\t顺数至立秋月（申月开始）\n立秋月（申月）\t顺数至白露月（酉月开始）\n白露月（酉月）\t顺数至寒露月（戌月开始）\n寒露月（戌月）\t顺数至立冬月（亥月开始）\n立冬月（亥月）\t顺", "午月开始）\n芒种月（午月）\t顺数至小暑月（未月开始）\n小暑月（未月）\t顺数至立秋月（申月开始）\n立秋月（申月）\t顺数至白露月（酉月开始）\n白露月（酉月）\t顺数至寒露月（戌月开始）\n寒露月（戌月）\t顺数至立冬月（亥月开始）\n立冬月（亥月）\t顺数至大雪月（子月开始）\n大雪月（子月）\t顺数至小寒月（丑月开始）\n小寒月（丑月）\t顺数至立春月（寅月开始）\n2. 年干为阳（甲、丙、戊、庚、壬）：逆排大运\n出生节气月\t大运排列方向\n立春月（寅月）\t逆数至立春月（寅月开始）\n惊蛰月（卯月）\t逆数至惊蛰月（卯月开始）\n清明月（辰月）\t逆数至清明月（辰月开始）\n立夏月（巳月）\t逆数至立夏月（巳月开始）\n芒种月（午月）\t逆数至芒种月（午月开始）\n小暑月（未月）\t逆数至小暑月（未月开始）\n立秋月（申月）\t逆数至立秋月（申月开始）\n白露月（酉月）\t逆数至白露月（酉月开始）\n寒露月（戌月）\t逆数至寒露月（戌月开始）\n立冬月（亥月）\t逆数至立冬月（亥月开始）\n大雪月（子月）\t逆数至大雪月（子月开始）\n小寒月（丑月）\t逆数至小寒月（丑月开始）\n\n全国地理位置五行属性\n\n\n命格类别输入\n日主强弱旺衰判断\n日主强弱：指日干在八字结构中的旺衰情况\n\n得势一一得势者乃党多势众，如四柱中多见比肩和印绶，使日主强旺，叫做得势。\n得令——四柱月支中五行同我生我，谓之日干得令于出生之月。如甲乙日干生于春天，丙丁日干生于夏天，庚辛日干生于秋天，壬癸日干生于冬天都谓之得令。\n得地——日主逢四柱中的地支临于十二宫中长生、建禄、帝旺者。其五行运走到某岁运或某柱者，谓之“得地”。\n强旺——日主得到印星，比劫众多生助为“强”。日主生于当", "甲乙日干生于春天，丙丁日干生于夏天，庚辛日干生于秋天，壬癸日干生于冬天都谓之得令。\n得地——日主逢四柱中的地支临于十二宫中长生、建禄、帝旺者。其五行运走到某岁运或某柱者，谓之“得地”。\n强旺——日主得到印星，比劫众多生助为“强”。日主生于当令之月，如甲乙木生于春天，丙丁火生于夏天……谓之旺。\n弱者扶之，强者抑之，贵在中和\n正八格：正官，七杀；正财，偏财；正印，偏印；食神，伤官；\n\n奇格：羊刃格，建禄格，魁罡格，三奇贵人格。\n魁罡：庚辰   壬辰   庚戌    戊戌\n天上三奇：甲 戊 庚\n地上三奇：乙 丙 丁\n人中三奇：壬 癸 辛\n\n专旺格，从格\n专旺格：曲直格（木）、炎上格（火）、稼穑格（土）、从革格（金）、润下格（水）\n从旺格：从杀格、从财格、从儿格、从势格\n\n格局分辨，格，局。\n八字的格局，可分为两大类：一类为特别格局，一类为普通格局，—般八字中普通格局占绝大多数，特别格局只是其中一小部份而己，辨别格局如果适合特别格局，就先取特别格局，如果不合特别格局，再取普通格局。\n第一节 特别格局\nA、旺格\n⑴从旺格：从旺就是指四柱皆比肩劫财有少量印绶之生，但毫无官杀制身，这种命局就叫从旺格。碰到这种从旺格的命局，就要从其旺神，应取旺神为用神。其行运吉凶是：喜行比劫印绶运。如局中印轻或无，行伤官食神运也佳；如局中印多而有力，行食神伤官运不吉；行官杀运，制其旺神，叫犯旺，大凶；行财运群比争财，九死一生。\n⑵从强格：四柱印绶多而旺，比劫也多，日柱当令，而毫无一点财官之气，这种命局就叫从强格。这种命局同样喜行比劫印绶运；忌行财运官运。但因命局中印绶多而旺，所以遇食伤要遭印绶冲克，故而大凶。", "运，制其旺神，叫犯旺，大凶；行财运群比争财，九死一生。\n⑵从强格：四柱印绶多而旺，比劫也多，日柱当令，而毫无一点财官之气，这种命局就叫从强格。这种命局同样喜行比劫印绶运；忌行财运官运。但因命局中印绶多而旺，所以遇食伤要遭印绶冲克，故而大凶。\n一、曲直格(木独旺)构成曲直格须有下列条件：\n(一)、日主为甲、乙、木。\n(二)、生寅卯(辰)月，木气当令或亥未得月支余气。\n(三)、四柱无庚辛酉等克木。\n(四)、地支见三会局，三合局化木，或木多势旺。\n二、炎上格(火独旺)。\n(一)、日主为丙丁火；\n(二)、生巳午(未)月得气当令或寅午戌月得月支余气；\n(三)、四柱火木众多；\n(四)、全局无壬癸子水等破格。\n三、稼穑格(土独旺)\n(一)、日主为戊己土。\n(二)、生于辰丑未月土气当令或四柱纯土。(三)、地支辰戌丑未四库全(三库亦可)，(四)、全局不见甲乙寅卯等木字破格。\n四、从革格(金独旺)\n(一)、日主为庚辛金。\n(二)、生于申酉月金气当令。\n(三)、地支己申酉戌三会金局，或巳酉丑三合化金局。\n(四)、全局不见丙丁午未等字破格。\n五、润下格(水独旺)\n(一)、日主为壬、癸水。\n(二)、生亥子(辰)月水气当令，或申丑月得月支余气\n(三)、四柱无戊己戌未等克水。\n(四)、地支见三会局、三合局化水，或水势众多。\nB、从格：日主孤弱无气，天地人三元绝无一毫生扶之意，财、官、食很强为真从。必是阳从阳，阴从阴，以所从之神论。《滴天髓》曰：“从得真者只论从，从神又有吉和凶。”“真从之象有几人？假从亦可发其身。”阳干从气不从势，阴干气势皆从。（成从格条件不够而勉强，比如微根，一点比劫印，为假从）。\n⑴、从", "意，财、官、食很强为真从。必是阳从阳，阴从阴，以所从之神论。《滴天髓》曰：“从得真者只论从，从神又有吉和凶。”“真从之象有几人？假从亦可发其身。”阳干从气不从势，阴干气势皆从。（成从格条件不够而勉强，比如微根，一点比劫印，为假从）。\n⑴、从气格：从气格是指日干全无生气，其中有一五行独自专旺的命局。\n⑵、从势格：日主无根，四柱中财、官、食伤并旺，不能分出强弱，并无比劫印绶生助日主，这样的命局就叫从势格。从势格的特点是不能从其某一专旺五行。只能采取和解的办法来处理。主要看财官食伤何者最旺，就取这个旺神之势而从之。如财官食伤力量相当，这时行财运引通食伤之气，形成食伤生财，财生官杀之势则吉。行财运最吉，官杀运次之，食伤运也吉。忌行比劫印绶运，遇之大凶。\n六、从财格\n(一)、日主弱，命局无半点比肩，劫财或正偏印生扶。天干透财。\n(二)、干支财旺，或有食神伤官泄日主而再生财。\n(三)、或有一点比劫、印星，被阳克阳，阴克阴，即成假从财。\n(四)、如命局有两个比劫或印星，不入格，为财多身弱论。\n七、从杀格\n(一)、日主弱，日主全无半点根气；\n(二)、日柱官杀多，不见食伤克制官杀；天干透杀。\n(三)、喜财生官杀。\n(四)、或有一点比劫、印星，被阳克阳，阴克阴，即成假从杀。\n(五)、如果原局有两个印星或比劫者，不入格，只作“杀重身轻”论。\n八、从儿格\n(一)、日主全无生气，月支一字是日主的食神或伤官，全局食神旺而透者。\n(二)、命局一定要有财(食伤生财即有儿也必要有孙)方成格。\n(三)、命局地支三合局或三合局化为食神伤官者。\n(四)、命局不见官杀或正偏印，克日主或克食伤。\nC、化气格\n《滴天髓》曰", "主全无生气，月支一字是日主的食神或伤官，全局食神旺而透者。\n(二)、命局一定要有财(食伤生财即有儿也必要有孙)方成格。\n(三)、命局地支三合局或三合局化为食神伤官者。\n(四)、命局不见官杀或正偏印，克日主或克食伤。\nC、化气格\n《滴天髓》曰：“化得真者只论化，化神还有几般话”。化气格还有从龙则化的说法。(一)、日干与邻干(月干或时干)五合成化成不同于日主五行的命局。\n(二)、在命局中，五合成化的五行在命局中形成专旺局面。\n(三)、化神与月支五行相同。\n(四)、喜食伤泄其旺势。\n⑴、丁壬化木格：\n1、日干丁，在月干或时干有壬；日干壬，在月或时干有丁；丁壬坐下是水木的地支。\n2、命局中其他干支木旺，没有被庚辛申酉金克破合化之木者，为真合化；若有庚辛申酉，但被丙丁巳午克去（或申被子辰合化水局），也算入格。\n3、出生于寅卯亥子月令及甲辰时，最易入格；未月，有方局合局而定。\n⑵、戊癸化火格：\n1、日干戊，在月或时干有癸；日干癸，在月或时干有戊；戊癸坐下是木火地支；\n2、命局中其他干支火旺，没有壬亥子克破合化之火者为真合化；若局中有壬亥子，但被戊己辰戌丑未克去，也算入格。\n3、生于寅卯巳午月令及丙辰时，最易入格；生于辰、未、戌、丑月令，若地支形成巳午未或者寅午戌火方局，亦可入格。\n4、日干戊，不可生于甲乙月或时，日干癸，不可生于己月或时。\n⑶、甲己化土格：\n1、日干甲，在月或时干有己；日干己，在月或时干有甲；甲己坐下的是火土地支。\n2、命局中其他干支土旺，没有乙寅卯木克破化合之土者为真合化；若局中有乙寅卯木，但受庚辛申酉克去，也算入格；\n3、日干甲木，不可见庚月或时，日干己，不可见乙月或时", "：\n1、日干甲，在月或时干有己；日干己，在月或时干有甲；甲己坐下的是火土地支。\n2、命局中其他干支土旺，没有乙寅卯木克破化合之土者为真合化；若局中有乙寅卯木，但受庚辛申酉克去，也算入格；\n3、日干甲木，不可见庚月或时，日干己，不可见乙月或时。\n⑷、乙庚化金格：\n1、日干乙，月或时干庚，日干庚，月或时干乙；庚乙坐下是土金地支；\n2、命局中其他地支金旺，没有丙丁巳午火克破合化之金者为真合化；若局中有丙丁巳午，但受壬癸子水克去，也算入格。\n3、出生于申酉辰丑月令，最易入格；未戌月亦可入格，但是未是火的余气，戌是火库，必须注意五行用事分野及命局的燥湿问题，太燥则难入格。\n4、日干是乙木，不可生于辛月或时，日干是庚金，不可生于丙丁月或时。\n⑸、丙辛化水格：\n1、日干丙，月或时干辛，日干辛，月或时干丙，丙辛坐下是金水的地支。\n2、命局中其他地支水旺，没有戊己辰戌丑未土克破合化之水者为真合化格；若有戊己戌未，但被甲乙寅卯克去，丑被亥子会成北方水，辰被申子合成水局，也算入格。\n3、出生于申、亥、子月令，最易入格，其次是辰、丑月令，生于壬辰时者亦同；\n4、日干丙火，不可见戊己月或时；日干辛金，不可见丁月或时。\n第二节 普通格局\n一、以天透地藏为格；\n二、以三合、三会为格；\n三、以月令取格局：见调候与格局。\n正官格：\n一、日主旺，有财能生官杀，吉。\n二、日主弱，正官强，有印生身，吉。\n三、八字有正官，不见七杀(官杀混杂)，吉。\n四、日主旺，财轻，双劫重重(又不成外格者)，欠吉。\n五、遇刑冲破害，不吉。\n六、八字见官杀混杂，不吉。\n七杀格：\n一、日主旺，七杀为格，吉。\n二、日主旺，七杀太强，有食制杀", "正官强，有印生身，吉。\n三、八字有正官，不见七杀(官杀混杂)，吉。\n四、日主旺，财轻，双劫重重(又不成外格者)，欠吉。\n五、遇刑冲破害，不吉。\n六、八字见官杀混杂，不吉。\n七杀格：\n一、日主旺，七杀为格，吉。\n二、日主旺，七杀太强，有食制杀，吉。三、日主弱，杀旺，有印生日主，吉，无制降格。\n四、日主与七杀两宜，又见正官(无官混杀)，吉。\n五、日主弱，七杀为格，不吉。\n六、日主旺，七杀为格，遇刑冲破害，不吉。\n七、日主弱，又见财生七杀，而无食伤克制者，不吉。\n正印格：\n一、日主旺，有印逢官或杀，吉。\n二、日主旺，印强(非常多)，有食伤泄身，吉。\n三、日主强，印多以偏印论，有正财制印，吉。(但财不宜过多，而印变无力)\n四、日主弱，印弱，又逢财克印，不吉。五、日主弱，杀重，而又见官印，不吉。六，日主弱，印逢刑冲破害，不吉。\n偏正财格：\n一、日主旺，财亦旺，见官星制身，吉。二、日主弱，财星旺，有印比劫护身，吉。三、日主旺，财弱，有食神泄身生财(通关)吉。\n四、日干旺，财弱，又逢比劫多，帮身克财，欠吉。\n五、不管日主旺或弱，财逢刑冲破害，欠吉。\n食神格：\n一、日主旺，食神亦旺，见财泄食神，吉。二、日主旺，杀尤过之，见食神制杀(不见财生杀)者吉。\n三、日主弱，食伤泄身太过，有印护身，吉。\n四、日主旺，食轻，又逢印生身，欠吉。五、日主弱，食神生财，而又见七杀，不吉。\n六、日主旺，食神遇刑冲破害，不能泄身，欠吉。\n建禄、月刃格：\n一、日主旺、财，官杀亦旺，吉。\n二、日主旺，食伤亦旺，吉。\n三、日主弱、逢印，比劫帮身，吉。\n四、日主旺、财弱，又逢比劫多，不吉。五、日主旺、食伤弱，又逢印多克食伤，", "杀，不吉。\n六、日主旺，食神遇刑冲破害，不能泄身，欠吉。\n建禄、月刃格：\n一、日主旺、财，官杀亦旺，吉。\n二、日主旺，食伤亦旺，吉。\n三、日主弱、逢印，比劫帮身，吉。\n四、日主旺、财弱，又逢比劫多，不吉。五、日主旺、食伤弱，又逢印多克食伤，欠吉。\n六、日主弱，印，比劫弱，又多财官杀，不吉。\n伤官格：\n一、日主旺，伤官泄身生财，吉。\n二、日干弱，伤官泄身，有印生扶身，吉。三、日干旺，杀重，有伤官克制七杀，吉。四、日主弱，伤官旺，有印护身，制伤官，吉。\n五、日主弱，又见官杀克身，不吉。\n六、日主弱，财多生官杀，不吉。\n七、日干旺，伤官轻，又逢印多生身克伤官，欠吉。\n八、日干旺，伤官轻，又逢刑冲破害，欠吉。\n第三节 选择格局相神\n八字命局以特点有成不败为贵，若—个八字，格局有成局中不败大运流年能为护他或使他更理想又在合适年龄中，则会在相应方面有作为，反之破坏他，与格局要求的理想状态背道而驰，将会使相应方面的奋斗失败。适合格局所需的是格局相神。八字得宜有力的相神帮助，而趋于格身平衡，并合格局顺逆，便大有所为。如果在八字间，无有力的相神，而取较次之的相神，则其八字便不算上命，如果在八字间没有有力的相神，也没有较次的相神，那么就只好在岁运间的干支去求。\n取相神的方法，可分为二：\n一、正格日干强旺，取相神法\n(一)、日干旺，比劫多(比肩、劫财多，即与日主同类五行多。) 相神取官杀 (包括正官、七杀)因官杀能克制比劫。(无官杀、取财星、财星易遭比劫星克制，相神易受伤)(凡相神受伤不吉也。)\n(二)、日干旺，印星多，相神取财星(正财、偏财)因财能克印。(无财星用官杀或食伤，但不理想。因官杀虽能克", "类五行多。) 相神取官杀 (包括正官、七杀)因官杀能克制比劫。(无官杀、取财星、财星易遭比劫星克制，相神易受伤)(凡相神受伤不吉也。)\n(二)、日干旺，印星多，相神取财星(正财、偏财)因财能克印。(无财星用官杀或食伤，但不理想。因官杀虽能克日主比劫，但官杀又能生印。食伤 因印多，有遭克，用神受损之险。)\n(三)、日干强，比劫强，相神取食伤。(无食、伤取官杀或财星) (日干强，比劫强强比旺更强，也就是八字命局太偏旺) (旺宜克制，强用宜泄。如：个性强，可以用克制的方法，个性太强，用开导的方法。比劫强，用官杀不宜，因官杀亦无力克制强比劫，用财星又恐遭比劫克制，用神受伤)\n二、正格日干弱，取相神法\n(一)、日干弱，官杀多，取印化官杀为用，因官杀生印，转而生日干。(无印星，则用比劫，但不理想也。因命局官杀多，用比劫易受官杀克伐而遭破损)。\n(二)、日干弱，财星多，取比劫为用，因比劫星克伐财星生助日干。(无比劫星则取印星为用，但不理想，因印星易受财星克制)。(三)、日干弱，食伤多，相神取印星。因印星克制食伤。(无印星则用比劫，比劫可助日干，但不理想因比劫有再生食伤之嫌)。\n三、八格取(喜神）相神法原则：\n1、正官、正印、食神、正财、偏财顺用取相生为用；七煞、偏印、伤官、阳刃逆用取相制为用。\n2、身比格旺，扶格局；格比身旺扶身。\n3、身弱格强为忌，正印格除外。\n(一)、正官格之取相神法\n带印不如带财，身强利于身弱，身强以禄为第一。日主旺，正官为格，比劫多，取官星为相神，无官星可取食神或财为相神。比、劫、刃身旺，必须要正官自旺，不可以财来生官；印比、劫、刃制财，有损耗。比劫刃多可制财，以食神", "除外。\n(一)、正官格之取相神法\n带印不如带财，身强利于身弱，身强以禄为第一。日主旺，正官为格，比劫多，取官星为相神，无官星可取食神或财为相神。比、劫、刃身旺，必须要正官自旺，不可以财来生官；印比、劫、刃制财，有损耗。比劫刃多可制财，以食神生财，不使官孤。日主旺，正官为格，印多，取财为相神，无财取官或 食神为相神。日主旺，正官为格，食伤多，取财为相神，可用杀。官不够强，要用财星来生扶。身官平衡，有财更吉。日主弱，正官为格，财星多，取比劫为相神，无比劫，则取印为相神。日主弱，正官为格官杀多，取印为相神，无印则取比劫为相神。正官强于日主，以印通关。日主弱，正官为格食伤多，取印为用，无印则取比劫，但较差。正官格忌伤官，除非日主很强，又有财通关。忌大运合去正官，忌大运官星入库。(二)、七杀格之取相神印通关不如有制，制杀伤官不如食神。日主旺，七杀为格，比劫多，取杀星为用神，无杀星则取财为用。日主旺，七杀为格，印多，取财为相神，无财取杀星或 食伤为用。日主旺，七杀为格，官杀多，取食伤为相神，可取印。日主弱，七杀为格，财多，取比劫为相神，无比劫，取印为用。日主弱，七杀为格，官杀多，取印为相神，无印，取比劫为相神。日主弱，七杀为格，食伤多，以印为用，无印，取比劫为用。忌制，忌日主弱，忌冲刑\n(三)、偏正财之取相神喜身旺，最喜禄旺，无劫刃见官最佳。忌比劫刃。日主旺，偏正财为格，比劫多，取官杀为相神，无官杀，则取食伤为相神，财弱取食佳。日主旺，偏正财为格，印多，取财为相神，无财取官杀或食伤为相神。日主旺，偏正财为格，食伤多，取财为相神。日主弱，偏正财为格，财多，取印星为相神，无印星，取比劫为相神。", "主旺，偏正财为格，比劫多，取官杀为相神，无官杀，则取食伤为相神，财弱取食佳。日主旺，偏正财为格，印多，取财为相神，无财取官杀或食伤为相神。日主旺，偏正财为格，食伤多，取财为相神。日主弱，偏正财为格，财多，取印星为相神，无印星，取比劫为相神。日主弱，偏正财为格，官杀多，取印为相神，无印取比劫为相神。日主弱，偏正财为格，食伤多，取印为相神，无印取比劫为相神。\n(四)、正印之取相神法喜贵人，喜官杀，无官杀为清秀。日主旺，正印为格，比劫多，以官杀为相神，无官杀则取食伤为喜。日主旺，正印为格，印多以枭论，取财制，无财取官杀或食伤为喜。日主旺，正印为格，财多，以官杀通关为相神。日主弱，正印为格，财多，以官杀、印为相神，无官杀印降格以比劫为相神。日主弱，正印为格，官杀多，取印为相神，无印降格取比劫财为相神。日主弱，正印为格，食伤多，以印为相神，无印取比劫为相神。无官杀忌财；正印忌入墓；丑未正印忌木。\n(五)、偏印之取相神法喜在日主或格局为天月德贵人。日主旺，偏印为格，比劫多，以官杀为相神，无官杀降格则取食伤财为喜。日主旺，偏印为格，印多，取偏财最佳，无偏财取官杀或食伤为喜。日主旺，偏印为格，财多，以官杀通关为相神。日主弱，偏印为格，财多，以比劫为相神，无比劫取印为相神。日主弱，偏印为格，官杀多，取印为相神，无印，取比劫为相神。日主弱，偏印为格，食伤多，以印制食伤，无印取比劫为相神。忌冲刑合。\n(六)、食神格之取相神日主旺，食神为格，比劫多，以财为相神，无财降格取官杀食伤为相神。日主旺，食神为格，印多，以财制印，无财取官杀或食伤通关为喜，旺印要降格。日主旺，食神为格，财多，取官杀为相神，无官杀", "制食伤，无印取比劫为相神。忌冲刑合。\n(六)、食神格之取相神日主旺，食神为格，比劫多，以财为相神，无财降格取官杀食伤为相神。日主旺，食神为格，印多，以财制印，无财取官杀或食伤通关为喜，旺印要降格。日主旺，食神为格，财多，取官杀为相神，无官杀取食通关为喜。日主弱，食神为格，财多，取比劫为相神，无比劫，取印为相神。日主弱，食神为格，官杀多，取印为相神，无印取比劫为喜神。日主弱，食神为格，食伤多，取印为相神，无印取比劫为相神。\n(七)、伤官格之取相神日主旺，伤官为格，比劫多降格，以官杀为喜，无官杀取食伤或财为相神。日主旺，伤官为格，印多，偏印最佳，生财则富，无财取官杀或食伤为相神。日主弱，伤官为格，财多，取比劫为相神，无比劫，则取印为相神。日主弱，伤官为格，官杀多，取印为喜，无印，取比劫为相神。日主弱，伤官为格，食伤多，以印为喜，无印，取比劫为相神。\n四、建禄格之取相神法\n日主旺，建禄为格，取财官有力为相神，或食伤有力为相神(总以八字中和为原则)。日主弱，建禄为格，取印星或比劫为相神。五、月刃格之取相神法\n阳刃最宜架杀。日主旺，月刃为格，取财官有力为相神，或取食伤有力为相神。日主弱，月刃为格，取印星或比劫帮身为相神。忌无制不入他格。\n六、特别格局之取相神法\n日主专旺格，均以顺其旺势为佳，故均以其旺势所聚，为相神。曲直格，以木为相神；水为喜神，金为忌神。炎上格，以火为相神；喜木火，忌金水，怕冲，要身旺。稼穑格，以土为相神，水为喜，忌木。从革格，以金为相神；水土为喜，忌火，仇木。润下格，以水为相神；喜金，忌土。从财格，以食伤生财为相神；富裕而高寿，忌比劫禄刃。（原局若无食伤者，有妻、财、", "神。炎上格，以火为相神；喜木火，忌金水，怕冲，要身旺。稼穑格，以土为相神，水为喜，忌木。从革格，以金为相神；水土为喜，忌火，仇木。润下格，以水为相神；喜金，忌土。从财格，以食伤生财为相神；富裕而高寿，忌比劫禄刃。（原局若无食伤者，有妻、财、父及长辈损伤不利之事）又忌印星，有灾从官杀格，以财及官杀为相神，无财运多贵而财气不大；心性保守。从儿格，以食伤星为相神。化木格，以木为相神。化土格，以土为相神。化金格，以金为相神。化水格，以水为相神。化火格，以火为相神。\n关于内外十八格\n㈠、内十八格1、正官格 2、杂气财官格 3、月上偏官格 4、时上偏财格5、时上一位贵格 6、飞天禄马格7、倒冲格 8、乙巳鼠贵格 9、六乙鼠贵格\n10、合禄格 11、子遥巳格·丑遥巳格(遥格)12、壬骑龙背格13、井栏叉格 14、归禄格 15、六阴朝阳格16、刑合格 17、拱格(拱禄·拱贵)18、印绶格·杂气印绶格。\n㈡、外十八格\n1、六壬趋艮格 2、六甲趋乾格 3、勾陈得位格 4、玄武当权格 5、炎上格 6、润下格7、从革格8、稼穑格9、曲直仁寿格\n10、日德秀气格 11、福德格 12、从格(弃命从财格·弃命从杀格)13、伤官格(伤官生财格·伤官带杀者)14、岁德扶杀格 15、岁德扶财格 16、夹丘格 17、两干不杂格 18、五行俱足格\n㈢、有关暗冲与暗会部分\n1、飞天禄马格：庚子日、壬子日、辛亥日、癸亥日，生於十月、十一月，四柱无财宫，月支与时支相同或年日与日支相同，方能并冲。忌官星显露，禄难飞冲；合神羁绊，不能飞冲（丑绊子、寅绊亥）。要柱中有一字合住，方不走了贵气（如子多暗冲午，要柱中有未、寅、戌等任何", "马格：庚子日、壬子日、辛亥日、癸亥日，生於十月、十一月，四柱无财宫，月支与时支相同或年日与日支相同，方能并冲。忌官星显露，禄难飞冲；合神羁绊，不能飞冲（丑绊子、寅绊亥）。要柱中有一字合住，方不走了贵气（如子多暗冲午，要柱中有未、寅、戌等任何一字暗合午；亥多暗冲巳，要柱中有申、酉、丑等任合一字暗合巳）。喜伤官、食神及干支本运。所谓“飞天禄马”就是“暗冲而产生的官（禄）和财（马）”，一般多取庚子日、壬子日。\n2、倒冲禄格：丙午日、丁巳日生於夏月。丙以癸水为正官（禄），要柱中午多有力，冲出子中癸水，更得丑、申、辰之一字暗合子为妙（多字则不可），忌未羁绊巳及亥壬填实。丙午日亦可以地支寅午戌三合火局取格。\n3、井栏斜叉格：庚子、庚辰、庚申三日为主，地支三合申子辰水局，天干透三庚，名“庚日全逢润下”，忌丙丁巳午。丙子、甲申时，福减半。所谓“井栏叉”即井口，“润下”即水（申子辰三合水局），以申子辰暗冲寅午戌火局，庚日得官星为贵。\n4、子遥巳格：甲子日甲子时，两子中之癸水遥合巳宫戊土，戊来动丙（戊土附丙火而生），丙又去合酉宫辛金正官。大忌年月有午冲子、丑绊子，则不能遥合，亦忌见庚、辛、丙、申、酉、巳字为破格。喜生於壬、癸、亥、子印旺及寅、卯身旺之月。身强行官旺之运发达，忌南方运。“遥”与“邀”，意思相同。\n5、丑遥巳格：辛丑、癸丑日，用丑字多，遥合巳宫之丙（辛之正官）、戊（癸之正官）。若年支，时支见子或巳，则羁绊、填实而不能遥，反成虚名虚利。四柱中有申或酉之一字合住巳为妙，亦忌丙、丁、午，其中癸丑日又忌戌。\n6、专食合禄格：戊子、戊辰、戊申、戊戌日，庚申时，食神坐禄健旺，暗合乙卯官星。要无甲木", "辛之正官）、戊（癸之正官）。若年支，时支见子或巳，则羁绊、填实而不能遥，反成虚名虚利。四柱中有申或酉之一字合住巳为妙，亦忌丙、丁、午，其中癸丑日又忌戌。\n6、专食合禄格：戊子、戊辰、戊申、戊戌日，庚申时，食神坐禄健旺，暗合乙卯官星。要无甲木伤戊土（有甲要庚制或丙化）、丙火伤庚金、卯字填实官星、寅字冲申（寅年申月尤忌）。喜秋 冬生，食旺，爱财星、印绶，怕刑冲破害。\n7、专印合禄格：癸日庚申时，以庚申暗合乙卯食禄（爵星、天厨禄），又以申暗合巳中戊官、庚印、丙财三奇俱全）。喜生於秋冬，忌生於春夏及见戊、己、巳、午、丙克庚、寅冲申。喜行身旺、印旺，金水之运大发；忌入火运。\n8、拱禄格：“拱”即“夹”，此格有五日五时：①丁巳日丁未时拱午禄②戊辰日戊午时拱巳椽③己末日己巳时拱午禄④癸丑日癸亥时拱子禄⑤癸亥日癸丑时拱子禄。凡拱禄格，须日时同干，禄与月令通气，运行身、禄旺地大好，印绶、伤官、食神、财运亦吉；忌填实及刑冲破害、羊刃、七杀、空亡，伤了日时，则拱不住。\n9、拱贵格：拱贵有六日六时：①甲申日甲戌时拱酉贵②乙未日乙酉时拱申贵③甲寅日甲子时拱丑贵④戊申日戊午时暗拱未贵⑤辛丑日辛卯时供寅贵⑥壬辰日壬寅时拱卯贵。其中①②是拱正官（天福贵人），③至⑥是拱玉堂贵人（阴贵、夜贵）与天乙贵人（阳贵、昼贵），而⑥又可入“六壬趋艮格”。凡拱贵格的条件与拱禄格同。\n10、六甲趋乾格：亥配乾卦，甲日乙亥时也。亥为天门、紫微垣，甲为十干之首，尊贵也。亥为甲木长生之宫，且暗合寅为甲禄，故又称为“合禄格”。四柱不喜见财星，又忌寅填实，巳冲刑，岁运同。\n11、六壬趋艮格：壬日壬寅时，寅配艮卦为生门，合出亥为壬禄，即“", "六甲趋乾格：亥配乾卦，甲日乙亥时也。亥为天门、紫微垣，甲为十干之首，尊贵也。亥为甲木长生之宫，且暗合寅为甲禄，故又称为“合禄格”。四柱不喜见财星，又忌寅填实，巳冲刑，岁运同。\n11、六壬趋艮格：壬日壬寅时，寅配艮卦为生门，合出亥为壬禄，即“暗禄格”。忌亥字填实（逢亥月者贫）及刑冲克破。壬寅日、壬辰日为正。见寅字多者大富，以寅中甲木生丙火长生之财， 财旺生官，故美。忌官杀损身，申冲寅、庚伤甲、午合寅。\n㈣、其他\n1、时上一位贵格：即时上偏官（七杀）格，宜独见，须日旺，偏官有制，则贵。\n2、乙巳鼠贵格：\n3、六乙鼠贵格：乙日主。生于子时，名为聚贵为奇，宜生于亥卯未月及春月，最喜丙子时，忌午冲，不宜见四柱见庚辛申酉丑。\n4、壬骑龙背格：即壬辰日或壬日主辰时，喜辰寅字多，辰多贵，寅多富；官破宜伤制，最忌官多。\n5、六阴朝阳格：即辛日主见戊子时，忌丙丁巳午官杀，忌丑合，年月财格以财格论，运喜西方，次东方，南方平常，忌北方，忌冲破。\n6、刑合格：即癸日主生于甲寅时，喜柱中见酉丑，无官杀，不再见甲庚戊戌申己字，为贵，显赫。\n7、勾陈得位格：戊日主生申子辰日，或地支申子辰三合；己日主生于亥卯未日，或地支亥卯未三合；忌刑、冲、杀旺。\n8、玄武当权格：壬日主生于寅午戌日，或合会火局；癸日主生于未丑巳日，或合会火局。忌水及刑冲。\n9、日德秀气格：丙子日壬子日辛卯日丁酉日有乙出干或天干三乙会巳酉丑全者；忌刑冲克。\n10、福德格：己日干生于巳酉丑日，合会金局；忌刑冲及见火。\n11、岁德扶杀格：甲日见庚年杀有制则祖上有要职。\n12、岁德扶财格：甲日见戊己年，得祖上财产。\n13、夹丘格：即日支与时支拱财；忌", "丁酉日有乙出干或天干三乙会巳酉丑全者；忌刑冲克。\n10、福德格：己日干生于巳酉丑日，合会金局；忌刑冲及见火。\n11、岁德扶杀格：甲日见庚年杀有制则祖上有要职。\n12、岁德扶财格：甲日见戊己年，得祖上财产。\n13、夹丘格：即日支与时支拱财；忌填实、牵绊；身旺财旺运吉\n14、两干不杂格：即年月、日时连占两干，统一而不杂；利名。\n15、五行俱足格：即年月日时胎之纳音刚好五行都有配齐。\n\n\n用神分辨\n体用\n\n\n十天干喜用神，忌神，调候用神，扶抑用神，格局用神，通关用神，病药用神。\n扶抑——扶者帮扶也，抑者制也，此乃八字取用之法。曰主弱者用印绶生扶，日主强者取官煞抑制，以求日主平衡。日干的用神是十神之一。日主以中和平衡为顺，太过不及均为命中有病。扶助，指生我之印星扶我，同我之比劫助我。这样命局就趋于平和了，克抑，指以克我之官星抑我，我生之食伤泄我，我克之财星耗我。 日主衰弱，命局须扶助时，根据忌神多少选取用神。多官杀：取印星为用神，泄官生身，若无印星则取比劫为用神，以泄官助身。多财星：取比劫为用神，抑财助身。若无比劫，则取印星为用神，耗财生身。多食伤：取印星为用神，抑食伤生身，故无印星则取比劫为用神，助身补泄。日主强旺：命局须抑耗泄时，亦根据忌神多少选取用神：多印星：取财星为用神，抑印耗身。若无财星，则取官杀为用神，抑身。或取食伤为用神，泄耗印。多比劫：取官杀为用神，抑比劫旺身。若无官杀，取食伤为用神，泄比劫泄旺身若无两者，取财星为用神，耗比劫耗旺身。\n病药——以扶为喜，则以伤其扶者为病；以抑为喜，则以去其抑者为病。除其病神，即谓之药。此以病药取用神也。\n调候——八字命局以中和为责，寒暖", "：取官杀为用神，抑比劫旺身。若无官杀，取食伤为用神，泄比劫泄旺身若无两者，取财星为用神，耗比劫耗旺身。\n病药——以扶为喜，则以伤其扶者为病；以抑为喜，则以去其抑者为病。除其病神，即谓之药。此以病药取用神也。\n调候——八字命局以中和为责，寒暖燥湿皆是太过或不及，一般取用之法，夏季之热需水来调候，冬季之寒需火来调候，也就是过于寒凉,需用暖药来医，过于热需用寒药来治，过于湿需用燥药来医，过于燥应用湿药来治，谓之调候。\n天道有寒暖，人采天地之气，故离不开寒暖燥湿影响。人以生日为主，月令为提纲，依日干五行及月支论命局的寒暖燥湿。太寒用暖医，太暖用寒治；过湿用燥医，过燥用湿治。使其适候，谓之调候。夏月生人，不论日干五行为何，因偏暖过燥，四柱离不开五行之水寒湿调候，须和扶抑一并参断。\n冬月生人，不论日干五行为何，因过寒偏湿，四柱离不开五行之火暖燥调候，亦须和扶抑一并参断。\n春秋之月生人，则寒暖适候，湿燥适度，水火不一定参与调候，只论五行生克制化。\n如日干为庚金，生于冬月，没有火暖，则为金寒水冷，庚主筋骨，筋骨处死地，气血不通而病痛，甚至导致瘫疾。四柱命局如没有火，则为缺调候。缺就要补，运上能补则为顺通，到南方火地则是人为地补，不但对身体有利，也可理顺背运。此也是解灾的一个方面。\n四季之未生人也有寒暖燥湿之分。五行兴旺各有一定的时候，只有土居中央，贯于八方，没有固定的处所，于是在每个立春、立夏、立秋、立冬四立之前各旺十八天。\n通关——八字取用之方法，如八字出现两行相争，势均力敌的时候，须在两者之间给以双方调解，使命局气势流通的就叫通关，这个能调解通关的就是用神。命局两种五行相对立，势均力敌，相", "没有固定的处所，于是在每个立春、立夏、立秋、立冬四立之前各旺十八天。\n通关——八字取用之方法，如八字出现两行相争，势均力敌的时候，须在两者之间给以双方调解，使命局气势流通的就叫通关，这个能调解通关的就是用神。命局两种五行相对立，势均力敌，相争之下，两败俱伤，此亦为病。择其一能使两种五行生化不悖则命局气势流通的用神，来调停，谓之通关。火金相战，以土通关；水火相战，以火通关；水火相战，以木通关；金木相战，以水通关。土水相战，以金通关。如水与火不相容，以木为用神，木泄水生火，五行之性连续为相生，隔位为相克，现化无情为有情，化敌为友，乃用神之功劳也。\n流通——八字中五行不存在缺失，五行齐全并且流通有情，组成木生火，火生土，土生金，金生水，水生木。流通而不阻塞，清纯而不浊乱，顺气而无阻隔。天干五行接续相生（古称连珠），柱中虽无主根，但有生源，则具流通能力。\n调候附件\n \n命盘分析\n命盘结构\n四柱——即年、月、日、时称之为四柱，年干支叫年柱，月干支叫月柱，日干支叫日柱，时干支叫时柱。\n八字——指年干支、月干支、日干支、时干支，四柱干支分开来共是八个字，称为八字。\n命局——又叫命造乃是四柱八字的统称，亦简称为“命”或“造”。\n六亲宫位\n\n干支时效性\n\n社会环境\n\n命局分析梗概\n先观该命盘日元为何，再看月令生于几月，注意，在寅，巳，申，亥与辰、戌、丑、未月中生者。需要注意生与寅，巳，申，亥上半月还是下半月，以及辰、戌、丑、未的上半月还是下半月，因要判断流月五行能量所以此点注意。\n定生于几月后，看月令对日主是何种状态（生，扶，克，泄。），以此来定最大的基本论调，如甲木生酉月不得月令；甲木生于寅月", "生者。需要注意生与寅，巳，申，亥上半月还是下半月，以及辰、戌、丑、未的上半月还是下半月，因要判断流月五行能量所以此点注意。\n定生于几月后，看月令对日主是何种状态（生，扶，克，泄。），以此来定最大的基本论调，如甲木生酉月不得月令；甲木生于寅月得令相助。\n定月令旺衰情况，是否月令本气透干成格？或月令其余藏根有无透干成格？成格对命主的生扶克泄状态。\n观有无合局、会局，定能否成局。成局对命主的生扶克泄状态。成局后有无透干可否成格局。注：伤官格局自动化伤官生财格，也作偏财格局。\n以格与局，取原局有无命主之根基，或有力生扶来判断日主旺衰情况。男命喜旺，女命喜衰。克泄过者取生扶者，生扶过者取抑者也。\n取格局方法，取格：天透地藏（成局透干），四见取格（正偏有或过四数）注：尽量分清格和局区别。\n取格与局、格局都是为了先寻找全局有无第一力量五行，定完格局后，观其盘有无缺之五行，太甚。再观有无需要调候用神需求，若有，原局可有调候？再观有无喜用神，有，观其状态。弱之可扶。\n分析原局有无不流通之地，比如劫财见财，可用食伤流通。\n如若命主无格局取用，按月令取调候，取扶抑日主之用神，后取喜用，再取通关。\n\n\n命盘步骤分析详解\n\n出生地与发展地五行对命主增减\n先天五行，以河南为中心，中央土。北水（北京、东北、天津），南火（广东、广西、福建、），东木（山东，江浙），西金（四川，西藏，新疆）。其他地支辰戌丑未另可额外算。\n后天五行，若先天命造欠缺五行，所生之地又克耗自己，命主无能力更改地方就需要动后天五行做解救。依然北水、东木、西金、南火、不动为土。\n特殊城市：火（南京，武汉，长沙，），水（上海），水木（浙江，江", "，西藏，新疆）。其他地支辰戌丑未另可额外算。\n后天五行，若先天命造欠缺五行，所生之地又克耗自己，命主无能力更改地方就需要动后天五行做解救。依然北水、东木、西金、南火、不动为土。\n特殊城市：火（南京，武汉，长沙，），水（上海），水木（浙江，江苏）\n地区五行对命主增幅的作用：地区五行的能力非常强大，比调整风水带来的增益还要高出很多，是拉高一个人人生成就上限。是命运里不可或缺的一块拼图，一个人一生可能一直行运不顺的原因就在于，生活在克自己或加强了克自己五行的城市，那必定不顺。或在有危险的年份行至辰戌丑未的城市带来冲刑破害的祸事。例如：若命主命盘里欠缺喜用，调候这种拉高命局层次的盘，去了相应五行的城市，必定立马有所好转，比如命主状态变好，身边工作环境琐事减少。随着时间增长，地区五行逐渐影响日主，命主的缺陷被补齐，必会生发。\n职业论断\n吃皇粮\n私人老板\n打工\n自由工作\n\n我与比劫的关系\n\n\n前事论断：六亲、学历、身体、情感、事业、财运\n大众问事类别总览：学业、财运、事业、考学。考公、情感（恋爱）、婚姻、子女、官非\n男女区分\n一、男命与女命事业婚姻区别\n1.男命财通妻，女命夫通事业。男命的财同时代表妻子和财（经济来源），女命官杀同时代表丈夫和工作（管制源头）。男命官杀同时代表子女和事业（体制、权利），女命食伤代表子女。\n2.男命女命比劫旺，如自坐羊刃都不利婚姻，指脾气太过强势，不利与婚内和谐，多吵架甚至动手。\n3.\n二、男旺\n1.男命身旺：泛指有自己的主观想法，不容易被外部所轻易动摇。有抗压能力去承受外在的压力（官杀），有能力去做想做的事，有抗压能力完成自己想要完成的目标（七杀）。可以落实", "利婚姻，指脾气太过强势，不利与婚内和谐，多吵架甚至动手。\n3.\n二、男旺\n1.男命身旺：泛指有自己的主观想法，不容易被外部所轻易动摇。有抗压能力去承受外在的压力（官杀），有能力去做想做的事，有抗压能力完成自己想要完成的目标（七杀）。可以落实事情步骤按部就班做事（偏财或正财做事）\n2.男命身过旺：身过旺最有代表性的是比劫禄刃印全，命主的心态容易过于自信，自负。对待事情的判断坚持自己的一套理念，对他人的建议不会接纳。缺乏官杀带来的制约，容易产生反叛，过度强势心理。身体健康也会有一定影响。\n3.男命身衰：身衰的男命一般没有自己的主观能力，缺乏行动力，对外界事物带来的影响会轻易随波逐流。身体健康也会受影响，内心无法自理。再逢官杀攻克，更容易受到打击，无法自主脱离。因无助力，缺乏外界帮助。男命身衰一般阳气下降，不能够拥有男性正常的阳刚之气，所以再来财重，多见怕妻。印多，多为没有自理能力。官杀多，多畏首畏尾。\n\n三、女命\n1.女命身旺：女命属阴，身旺气盛则体内阳盛阴衰，为失衡之意，女性有出门工作，创业，在家里也是话语权多，除非遇到顺遂的丈夫，一般不为好婚姻。\n2.女命身衰：身衰之人宜静，最利女命，不争强好胜，不多管闲事，不絮絮叨叨。\n3.女命官杀多：多一般指四见或四之上，命主宜对感情拥有过多寄托和需求，尤其是官多贱之论断，都是四正官之数以上。何为贱？对情感需求过度追求，难以自拔，常人难以理解之行为。\n4.女命事业：女强人多出在七杀或羊刃格，独立自主的个性，强势的态度，坚定不移的意志。对于当下社会对女性传统的观点，自身可以创造或者寻找打破束缚观念的能力和机会。但脾气太过强势，不利婚姻。\n现代", "感需求过度追求，难以自拔，常人难以理解之行为。\n4.女命事业：女强人多出在七杀或羊刃格，独立自主的个性，强势的态度，坚定不移的意志。对于当下社会对女性传统的观点，自身可以创造或者寻找打破束缚观念的能力和机会。但脾气太过强势，不利婚姻。\n现代社会男女世界观跟进\n古代世界观可取之点\n性格详解\n总结全盘论断命主性格\n五行性：木主仁，其性直，其情和。木盛的人长得丰姿秀丽，骨骼修长，手足细腻，日尖发美，面色清白。为人有博爱恻隐之心，慈祥恺悌之意，清高慷慨，质朴无伪。木衰之人则个子瘦长，头发稀少，性格偏狭，嫉妒不仁。木气死绝之人则眉眼不正，项长喉结，肌肉干燥，为人鄙下吝啬。（过旺：太心慈，易心黑，固执，执拗，不谦逊）\n火主礼，其性急，其情恭。火盛之人头小脚长，上尖下阔，浓眉小耳，精神闪烁，为人谦和恭敬，淳朴急躁。火衰之人则黄瘦尖楞，语言妄诞，诡诈妒毒，做事有始无终。（过旺：性急躁动，冒犯，无礼）\n土主信，其性重，其情厚。土盛的人圆腰阔鼻，眉清目秀，口才声重。为人忠孝至诚，肚量宽厚，言必信，行必果。土气太过则头脑僵化，愚拙不明，内向好静。不及之人面色忧滞，面扁鼻低，为人狠毒乖戾，不讲信用，不讲情理。金主义，其性刚，其情烈。\n金盛之人骨肉相称，面方白净，眉高眼深，体健神清。为人果断则毅，疏财仗义，深知廉耻。太过则有勇无谋，贪欲不仁。不及则身材瘦小，为人刻薄，喜淫好杀，吝啬贪婪。 \n水主智，其性聪，其情善。水旺之人面黑有彩，语言清和，为人深思熟虑，足智多谋，学识过人。太过则好说是非、飘荡贪淫。不及则人物短小，性情无常，胆小无略，行事反复。\n十天干性：十天干是五行分出来的阴阳，主要是对五行单一性格", "喜淫好杀，吝啬贪婪。 \n水主智，其性聪，其情善。水旺之人面黑有彩，语言清和，为人深思熟虑，足智多谋，学识过人。太过则好说是非、飘荡贪淫。不及则人物短小，性情无常，胆小无略，行事反复。\n十天干性：十天干是五行分出来的阴阳，主要是对五行单一性格进一步解读。\n甲（木）属阳。一般指森林大树，性质强壮。甲木为木之兄，还含有刚直自律之意；（曲直）\n乙（木）属阴。指小树，花草之类，性质软弱。乙木为木之妹，还含有谨慎固执之意（柔韧）\n丙（火）属阳。指太阳，炎炎炳照之意。丙火为炎之兄，含有朝气蓬勃、热情开朗之意。还含有适合于各种社交活动，但也易被误解为好大喜功；（风风火火）\n丁（火）属阴。指灯火、炉火等。火势不稳定，得时有力，失时无力。丁火为火之妹，具有外静内进，思想缜密的性格；（柔和而照他人）\n戊（土）属阳。指大地的土，广厚茂盛。又指堤坝之土，可有力地防止河川泛滥。戊土为土之兄，含有重视外表、善于交际、社交能力强的意思，但也有易失主见，与人聚合无常之意；（需要妆点）\n己（土）属阴。指田园之土，不如戊土广厚但易栽植。己土为土之妹，一般指心细，办事有规律，但也含有度量小之意；（生发万物）\n庚（金）属阳。指铁、刀剑、矿石等，性质坚硬。庚金为金之兄，其人略具文才，强调物质利益，有经济手腕；（个人解读：庚金为顽金，需要百炼成钢方可为用）\n辛（金）属阴。指珠玉、宝石、砂金。辛金为金之妹，它能够屡经磨难而终成大事，同时也含有顽固之意；（个人解读：辛金为钗钏不可炼）\n壬（水）属阳。指大海之水，壬水为水之兄，含有清浊并容、宽宏大度之意，能潜伏和包容，反之也有依赖性强，凡事漫不经心之意；（奔流不息）\n癸（水）属阴", "金。辛金为金之妹，它能够屡经磨难而终成大事，同时也含有顽固之意；（个人解读：辛金为钗钏不可炼）\n壬（水）属阳。指大海之水，壬水为水之兄，含有清浊并容、宽宏大度之意，能潜伏和包容，反之也有依赖性强，凡事漫不经心之意；（奔流不息）\n癸（水）属阴。指雨露之水，也有闭藏和内在萌生之意。癸水为水之妹，其人正直勤勉，身处逆境也会开拓出道路。（上善若水）\n断命主基础五行性格组成：以日主五行属性为核心观全局其他五行旺衰、对日主五行生克情况，例如命主甲木，自坐寅木禄神，其他克泄耗力量不过，维持平衡（男旺，女衰），则命主如木性描述“性直，情和，为人有博爱恻隐之心，慈祥恺悌之意，清高慷慨，质朴无伪”。若逢官杀、食伤克泄，为木气死绝状态则“眉眼不正，项长喉结，肌肉干燥，为人鄙下吝啬”过旺“固执、高傲、偏激（心善与心狠同存）、出言不逊”其余五行同理\n十神心性：正官：代表官位、职位、考试、选举、学位、名誉、地位。女命代表夫缘子缘。男命代表女儿缘。\n正官心性：正直负责，端庄严肃，循规蹈矩，但易流于刻板、墨守成规，反为意志不坚。\n偏官：代表军警武职、司法之业、暴徒官位职级、考试选举等。女命代表夫缘、女儿缘；男命代表子缘。\n偏官心性：豪爽侠义，积极进取，威严机敏，但易流于偏激，叛逆霸道反为堕落极端。\n正印：代表职位、权利、学业、学术、事业、名誉、地位、福寿等，还代表母缘。\n正印心性：聪颖仁慈，淡泊名利，逆来顺受，但易流于庸碌，缺乏进取，反为迟钝消极。\n偏印：代表偏业上之权位，如艺术、演艺、医业、律师、宗教、技艺、自由业、服务业之成就、发展、地位，还代表偏母缘。\n偏印心性：精明干练，反应机警，多才多艺，但易流于孤", "印心性：聪颖仁慈，淡泊名利，逆来顺受，但易流于庸碌，缺乏进取，反为迟钝消极。\n偏印：代表偏业上之权位，如艺术、演艺、医业、律师、宗教、技艺、自由业、服务业之成就、发展、地位，还代表偏母缘。\n偏印心性：精明干练，反应机警，多才多艺，但易流于孤独，缺乏人情，反为自私冷漠。\n比肩：代表手足、朋友、同事、合伙事业、争利夺财、克妻克父、义气等。女命代表姐妹缘；男命代表兄弟缘。\n比肩心性：稳健刚毅，冒险勇敢，积极进取，但易流于孤僻，缺乏合群，反为孤立寡合。\n劫财：代表手足、朋友等，还代表损财、夺财、夺妻、克父、争权夺利、放荡。女命代表兄弟缘，男命代表姐妹缘。\n劫财心性：热诚坦直，坚韧志旺，奋斗不屈，但易流于肓目，缺乏理智，反为蛮横冲动。\n食神：代表福寿、发胖、退休、食禄等。女命代表女儿缘，男命代表子缘。\n食神心性：温文随和，待人宽厚，善良体贴，但易流于虚伪，缺乏是非，反为迂腐懦怯。\n伤官：不利人家、不利夫、退职、免职、退学、休学、失权、丧位、落选、落榜等，女命代表子缘，男命代表女儿缘。\n伤官心性：聪明活跃，才华横溢，逞强好胜，但易流于任性，缺乏约束，反为桀傲不驯。\n正财：代表俸禄、产业、财运、薪资、妻缘等。\n正财心性：勤劳节俭，踏实保守，任劳任怨，但易流于苟且，缺乏进取，反为懦弱无能。\n偏财：代表偏业之财，横财、暴发、中奖、，赌博，父缘，男命代表妻缘。\n偏财心性：慷慨重情，聪敏机灵，乐观开朗，但易流于虚浮，缺乏节制，反为浮华风流。\n以上讲的是\"破则立\"的关系。还有一种\"不破也立\"的情况，即当某一天干旺而不破损，如日元一片比劫，命中无官星，就属于不受克，但比肩的心性也同样显露无遗。这各种情况", "偏财心性：慷慨重情，聪敏机灵，乐观开朗，但易流于虚浮，缺乏节制，反为浮华风流。\n以上讲的是\"破则立\"的关系。还有一种\"不破也立\"的情况，即当某一天干旺而不破损，如日元一片比劫，命中无官星，就属于不受克，但比肩的心性也同样显露无遗。这各种情况虽然不成在破（克）的关系，仍然具有独旺的与立同样的心性。\n\n近十年大运及刚过完大运性格影响\n大运组局：如原局寅卯再遇辰，寅午再见戌等等，见与大运可组成局，单一五行力量增加，代表原局的整体力量被提出，比如甲日主在遇见木局，心气剩，十年的经历，雁过留声，已经可以在命主本人性格里产生重要影响。当然，也可以看寅卯位置，比如在月令影响重要位置，在日柱自坐时间长的位置，在时柱固定到老的位置。都可以直下论断。\n大运组局另一看法：原局命主甲自坐禄寅木，但命主二十出头还未行至日宫影响，但在当下遇到三会三和木局，可视作提前影响，定下心性，以致命主行完大运已经至日宫失效，恰好心性已经成性。\n大运与三刑：丑未戌，寅巳申，亥亥，午午，辰辰，酉酉，必定原局已经有另两或一字，与大运可组，表示原局就有倾向，再遇则加强。\n原局月令透干，月干通根：原局月令寅木，再见大运天干甲木，为甲木透干，根开出果，因月令力量大，可影响全局。月干同理，但大运再见禄，力量依然强大，也可为得禄。\n商用合盘\n男女婚姻合盘\n商业合作伙伴合盘\n公司招聘合盘\n招收下属合盘\n大运流年断事\n大运分析\n对原局好坏影响：三和、三会、月令透干、三刑、自刑、见忌神、见用神（扶抑、通关、病药）、见喜神、喜神透干（同根）有力、忌神透干（同根）有力、用神透干（同根）有力、扶喜、忌、用神有力？\n小运影响（可不加）\n与流年同看", "盘\n大运流年断事\n大运分析\n对原局好坏影响：三和、三会、月令透干、三刑、自刑、见忌神、见用神（扶抑、通关、病药）、见喜神、喜神透干（同根）有力、忌神透干（同根）有力、用神透干（同根）有力、扶喜、忌、用神有力？\n小运影响（可不加）\n与流年同看，如与大运流年或原局有双冲，双合，反吟之事，需要着重分析。\n三年流年关系联系\n如果第一年出现双冲、双合、反吟等情况，需要往前一年一年看，看到没有再出现的流年，这个时候一般指事件开始。再从第一年往后看到没有出现这三种情况的流年，一般视作事件结束。（后续插图）\n五年流年关系联系\n同上\n前两年内双冲、双合、伏吟甄别。\n一、双冲一般不论吉，但要看十神生克与是否忌神对冲，若喜神被双冲，一般为凶。\n二、双合一般为吉，但也要看双合出来的是什么，如果是忌神，则为凶。是喜神，则为吉，并且有无增强现象，如果有，都加倍。另外也要看十神情况，合出来十神生克关系。\n三、伏吟一般不为吉，但看伏吟出来的五行是喜或忌，喜神则能量加倍，忌同理。也需看哪个十神伏吟，对具体事件影响。\n命理学发展史\n命理学发展史概要\n\n主要著作和理论发展概要\n \n待补", "八字性格\n五行性格\n木主仁，曲直，味酸，主仁。为人有博爱恻隐之心，慈祥恺悌之意，清高慷慨，质朴无伪，恻隐之心、慈祥恺悌、济物利民、恤孤念寡、恬静清高、人物清秀、体长、面色青白，故云：“木盛多仁”。\n  ①木气过旺至极：太过则折，执物性偏，太心慈，易心黑，固执，执拗，不谦逊。\n②木气过衰至极：不及少仁、心生妒意，性格偏狭，嫉妒不仁，为人鄙下吝啬\n火主礼，炎上，味苦，主礼。为人谦和恭敬，淳朴急躁，辞让之心、恭敬威仪、质重淳朴、人物面上尖下圆、印堂窄、鼻露窍、精神闪烁、言语辞急、意速心焦、面色或青赤、坐则摇膝。\n①火气过旺至极：太过则足恭聪明、性燥须赤，性急躁动，冒犯，无礼；\n②火气过衰至极：不及则尖巧妒毒、语言妄诞，诡诈妒毒，有始无终。\n金主义，从革，味辛辣也，主义。羞恶之心、仗义疏财、果断则毅、敢勇豪杰、知廉耻、主人中庸、骨肉相应、方面白色、眉高眼深、高鼻耳仰、声音清响、刚毅有决。\n  ①金气过旺至极：太过则自无仁心、好斗贪欲；有勇无谋，贪欲不仁。\n②金气过衰至极：不及则多三思、少果决悭吝、作事挫志，为人刻薄，喜淫好杀，吝啬贪婪。\n水主智，润下，味咸，主智。是非之心、志足多谋、机关深远、文学聪明、谲诈飘荡、无力倾覆、陰谋好恶。\n  ①水气过旺至极：太过则孤介硬吝、不得众情、沉毒狠戾、失信颠倒；\n②水气过衰至极：不及则胆小无谋，反主人物瘦小。\n土主信，稼穑勾陈，味甘，主信。诚实之心、敦厚至诚、言行相顾、好敬神佛、主人背圆腰阔、鼻大口方、眉目清秀、面如墙壁而色黄、处事不轻、度量宽厚。\n  ①土气过旺至极：太过则愚朴、古执如痴；\n②土气过衰至极：不及则颜色似忧、鼻低面偏、声重浊、朴实执", "主信，稼穑勾陈，味甘，主信。诚实之心、敦厚至诚、言行相顾、好敬神佛、主人背圆腰阔、鼻大口方、眉目清秀、面如墙壁而色黄、处事不轻、度量宽厚。\n  ①土气过旺至极：太过则愚朴、古执如痴；\n②土气过衰至极：不及则颜色似忧、鼻低面偏、声重浊、朴实执拗。\n\n十天干性格\n甲木，是阳木，象征参天大树，是十天干之首。\n富有向上学习心，有毅力，不服输，不懂得拐弯，凡事强出头。\n领袖欲强，喜欢领导，不喜欢被领导，不甘心屈于下，永不低头。\n脚踏实地不喜随意变动。\n心地善良，仁慈温情，心肠软容易被利用。\n喜明争不喜暗斗，正直磊落。\n容易疲劳，须注意肝胆。\n\n乙木，是阴木，象征花草之木，是十天干中最柔顺的一种。\n性格温和细腻，有丰富的表现力和想象力，敏捷反应快。\n不会坚持己见，善于变通和沟通，能够顺势而为，适应力超强。\n喜欢小花小草，声音温柔，适合做幕后老板或者从事艺术创作。\n善于理财和谋略，有最佳情绪管理能力和韧性。\n喜暗斗不喜明争，正直磊落但不喜欢被反驳。\n\n丙火，是阳火，象征太阳之火，是十天干中最热情的一种。\n性格积极乐观，活力四射，风趣幽默，无私奉献，开朗直爽。\n自信慷慨，待人亲切，理解力强，做事积极，易得人好感。\n躁动急躁，脾气大但易消散，冲动做事，喜怒无常，好面子，在意他人评价。\n坚强勇敢，阳光乐观，但有时负担太重又不愿与他人倾诉，造成压力过大。\n\n丁火，是阴火，象征灯烛之火，也属星星之火。\n有礼貌，知礼敬长，疼惜晚辈，喜关怀别人，热心公益。\n有第六感，直觉性强，不喜太被亲近。\n温和有礼，而且也很热情，在行事方面上也很谨慎。\n不善拒绝别人，易猜忌怀疑，而且很容易聪明反被聪明误。\n具有伟大的奉", "是阴火，象征灯烛之火，也属星星之火。\n有礼貌，知礼敬长，疼惜晚辈，喜关怀别人，热心公益。\n有第六感，直觉性强，不喜太被亲近。\n温和有礼，而且也很热情，在行事方面上也很谨慎。\n不善拒绝别人，易猜忌怀疑，而且很容易聪明反被聪明误。\n具有伟大的奉献精神，有燃烧自己而照亮别人的一种精神。\n文雅细腻、情感丰富、具有一定程度的文字处理能力。\n\n戊土，属阳土，为城墙之土，也属大地之土。\n诚信为本，不耍小聪明，不耍心机。\n极具包容心，脾气很好，不会与人争强斗狠。\n沉着厚重，拥有极强的容忍力和受苦力。\n外表柔软，但内心刚烈，对理想坚持到底。\n对信仰的坚定根本无法动摇，很要强，也非常渴望成功。\n很重诺言，言出必行，给人很大安全感。\n不善于灵活变通，反应比较迟钝。\n不善言谈，更不会花言巧语。\n\n己土，属阴土，为田园之土，也属隐藏之土。\n固执己见，重义气，善理事，好沟通。\n外表温和，内心猜忌叛逆。\n包容性强，常感怀才不遇。\n讲信用，可塑性强。\n重内涵，多才多艺，\n行事循规蹈矩，但肚量欠广，易生疑心。\n己土人喜丁火相生，畏惧丙火。\n\n庚金，属阳金，为刀剑之金，也属顽石之金。\n刚强威武，果断理性，有原则有担当，可以独当一面。\n非常讲义气，忠诚可靠，为朋友两肋插刀。\n直来直往，不虚伪不拘小节，自我表现欲强。\n冲动粗率，缺乏耐心细心，容易得罪人。\n性格过于刚硬，吃软不吃硬，内心容易受伤。\n\n辛金，属阴金，为珠玉之金，也属首饰之金。\n敏感细腻，温润秀气，为人亲切有同情心，重感情，人际关系好。\n善恶分明，时有独特想法，不盲目讲义气，会思考有小心思。\n好面子，虚荣心强，有强烈的自尊心，但缺乏坚强的意志，在乎外表讨厌", "内心容易受伤。\n\n辛金，属阴金，为珠玉之金，也属首饰之金。\n敏感细腻，温润秀气，为人亲切有同情心，重感情，人际关系好。\n善恶分明，时有独特想法，不盲目讲义气，会思考有小心思。\n好面子，虚荣心强，有强烈的自尊心，但缺乏坚强的意志，在乎外表讨厌丢面子。\n外柔内刚，坚毅果敢，具备“水滴石穿”的恒心。\n善于变通，能快速适应新环境，适合开拓进取。\n\n壬水，属阳水，为大海之水，滔滔江河之水。\n喜放任自由，不受他人约束。\n处事不计较个人得失，是慷慨之人。\n率性自由，悠闲而乐观，有勇气，能面对困难不退缩。\n智慧聪明，善于变通，文武双全，有领导能力。\n重责任，交际广，人缘佳。\n爽朗坦荡，豁达大度，不拘小节。\n\n癸水，属阴水，为雨露之水，有滋润万物的德行。\n聪慧灵活，细水长流，擅于随机应变。\n重视规则和道德，勤奋努力。\n足智多谋，目光高远，喜新厌旧，喜自由。\n聪明细心，懂得以柔制刚。\n善变而幻想力丰富，有浪漫情怀，也有点神经质，常有不切实际的希望。\n\n十神性格\n正官\n优点：为人端庄，稳重，正直保守，秉公尚义，负责任，重信用，讲规范，安于本分，有目标理想，肯服务人群，易得群众爱戴信任。\n缺点：往往不够积极，过于保守及优柔寡断，以至临事犹豫不决而常坐失良机。\n\n七杀\n优点：为人志大进取，坚强果决，嫉恶如仇，见义勇为，抑强扶弱，不善虚饰，具革命性及叛逆性。勇于突破环境，开创新机。举止威严有权，有领导力，可得他人敬畏。\n缺点：个性刚强，有时过于偏激，别人难以适应，因此较少知心朋友，多年友谊亦于一日之间反目。由于好胜心强，对人猜忌而不信任，亦较易树敌招祸。又由于冲动，常致行事粗鲁凶暴。\n偏官为忌神，喜欢酒色", "，开创新机。举止威严有权，有领导力，可得他人敬畏。\n缺点：个性刚强，有时过于偏激，别人难以适应，因此较少知心朋友，多年友谊亦于一日之间反目。由于好胜心强，对人猜忌而不信任，亦较易树敌招祸。又由于冲动，常致行事粗鲁凶暴。\n偏官为忌神，喜欢酒色而好斗，而且个性急躁，容易和他人发生冲突，做事过度激进，使人难于容忍与谅解而树敌，所以知心朋友不多。\n偏官为喜用，有狭义心，争斗性旺盛，决断力强，喜欢冒险，有志气，富进取心，言出必行，不善虚伪客套，勇于突破恶劣环境，当世界愈纷乱的时候，偏官的真正价值也就能真正发挥出来。\n\n正印\n优点：为人方正亲切，宽容仁慈，不计仇恨，重名誉，讲人情，能得享现成之福气。重视内涵及气质，追求学问，自远小人，易得名誉，易近宗教。\n缺点：较有依赖性。思想天真天马行空不切实际。不善于察言观色，常因轻重不分而自讨没趣，又由于好面子而过于矫饰。\n\n偏印\n优点：领悟力极强，感觉敏锐，善于观察，警觉性高并能保密，喜创造，好学艺术，擅长怪招奇术，思想细腻。\n缺点：耐性不足，行事三心二意，常无事空忙。多学少成，博而不精，思想奇特，标新立异。亦喜抄捷径旁门左道。内向多疑，喜钻牛角尖，喜独处不喜群居及参加社交活动，常予人孤僻之感。\n\n食神\n优点：智慧聪明，有才华，气质高雅，重精神和物质之均衡发展。为人温和，通情达理，不与人争，思想脱俗，对精神生活追求很有目标。感情强，爱好文艺歌舞摄影，凡事能预先为长远打算。亦主有口福，善烹调。\n缺点：理想高远，易致超脱现实。耐性虽有，体力不足。喜幻想，不喜被拘束。思想清高，自负不凡，内心常觉空虚寂寞。喜吃零食，喜烹调，对饮食文化有一定见解，在外吃饭机", "求很有目标。感情强，爱好文艺歌舞摄影，凡事能预先为长远打算。亦主有口福，善烹调。\n缺点：理想高远，易致超脱现实。耐性虽有，体力不足。喜幻想，不喜被拘束。思想清高，自负不凡，内心常觉空虚寂寞。喜吃零食，喜烹调，对饮食文化有一定见解，在外吃饭机会多。\n伤官\n优点：领悟力强，理想高远，追求完美生活。有独裁倔强个性。自信甚强，斗志昂扬，学习能力强，易成英雄人物。伤官在命，若非多学多能，就是相貌清秀。在自由事业，精密技术、演艺事业方面，易获特殊成功，也可站在台前或从事口才之事业。\n缺点：领悟力与兴趣广泛，博而不精。易恃才而骄，不喜世俗礼法拘束，行为易致任性乖张。狂妄自大，容易冲撞和顶撞上级长辈和他人。\n正财\n优点：言行力求合乎中庸，不喜标新立异及惹是生非。守本份，努力工作，勤俭，任劳任怨。爱护家庭，对妻儿尽责，守信用，能知足。\n缺点：爱惜金钱，不免吝啬寡情。过于谨慎，以致魄力不足。行事欠缺恒心，虎头蛇尾过于安分，略嫌刻板。计较小人得失而因小失大。行事欠变通，不免憨真固执。\n偏财\n优点：精力充沛，性情急躁，待人慷慨豪爽。精明干练，善于掌握机会赚钱。擅交际，处事圆滑机智，举止轩昂，言行有威，一生多机缘巧遇，常有意外收获，乐观不怕挫折。\n缺点：豪爽慷慨，不大重视金钱，易致奢移浪费。不喜静坐家中，喜外出工作。喜钻营，擅交际，圆滑，多情，常有意外开销。\n比肩\n优点：意志坚定，一旦决定某事，决不轻易改变。自尊心强，明分寸，知进退，不做非分之求。自信心强，乐观进取，自我观念极重，与朋友虽保持距离，但重情意。\n缺点：刚愎自用，易与人发生争执。自我为先，较不体谅别人。虽与人和睦相处，交友虽多，知心极少，与", "点：意志坚定，一旦决定某事，决不轻易改变。自尊心强，明分寸，知进退，不做非分之求。自信心强，乐观进取，自我观念极重，与朋友虽保持距离，但重情意。\n缺点：刚愎自用，易与人发生争执。自我为先，较不体谅别人。虽与人和睦相处，交友虽多，知心极少，与亲人欠融通，口头虽称赞别人，内心却不服气。\n劫财\n优点：个性强而突出，口才好，善于在社交场合制造气氛，博人好感。反应灵敏，应变力强。性情矛盾，自我冲突常情绪化，易交朋友，也易失去朋友。\n缺点：脾气执拗，不服输，野心大，浮而不实，嫉妒心强，具有双重人格。不善理财。男子易对女性多情，对妻子不够体贴，并易因兄弟朋友之事与妻子争执。对朋友慷慨。如果劫财太多，行事粗鲁，易有勇而无谋。\n\n\n\n\n五行组合生克论取\n1、水得水多；\n“水得水多，则沉潜伏溺，小巧多权，苗而不秀，声誉汪洋”。水过旺则足智多谋，论业不厚却有享声名，而不據实权；然而富贵则无变通，而势不峥嵘矣。\n2、水得火多；\n“水得火多，则崇礼贪饕，自恃深虑多忧，猛断后悔”；其性如此，不妨名利也。\n水人见火多，则多疑他人侵犯，处处多礼以拒人之亲，凡事忧虑过深，孤疑猛断事项，常至断错原委而后悔。\n3、水得木多；\n“水得木多，则流而不止，执志反柔，临事汗漫，奢俭失中”。水生木，木旺克土，土散而无止，故此情性也。\n水人木多，食伤必重，精元耗散，失去根本，故作事散漫，忽热忽冷，朝令夕改，自失轻重之序。\n4、水得金多；\n“水得金多，则本末常安，多得资援，好义不实，智大多淫，智胜义负，则性灵强”。\n水人金多，金旺水浊，主其人人缘甚佳，满口仁义，心高志广，如遇大节之时，则重利舍义；如遇小仁小义之事，则舍利就义，机", "忽冷，朝令夕改，自失轻重之序。\n4、水得金多；\n“水得金多，则本末常安，多得资援，好义不实，智大多淫，智胜义负，则性灵强”。\n水人金多，金旺水浊，主其人人缘甚佳，满口仁义，心高志广，如遇大节之时，则重利舍义；如遇小仁小义之事，则舍利就义，机巧灵强。\n5、水得土多；\n“水得土多，则沉静执塞，内利外钝，忍妒多恨，信义无决”。水人土多，则为人外观木讷，内甚灵敏；\n故凡事多能逆恨，得时出其不意而决狠，得势信义无定论。原因就是官杀过重，土又主稳重，但智巧不够灵活。\n6、火得火多；\n“火得火多，则崇礼义泊，明外昏内，自华而俭，既旺即己，不可速达”。火旺主急燥，性暴而无制，福至则祸来连。\n又火主礼，火人火多，则礼仪甚过，小事察察，大事昏昏，服饰华丽，余事甚俭，凡事不可求速，速则引祸。\n7、火得木多；\n“火得木多，则自恃威福，聪明志懦，动思依辅，静则志明，好辩是非”。火若木多，有火塞之像，故仁与礼不足，虽和而多忘。\n火人木多，待下傲慢，聪明而少大志，临事吉则求靠山，凶则觅代罪之人，无事之时甚明达，有事临事好多辩。\n8、火得金多；\n“火得金多，则志不自胜，好辩而刚，礼义失中，直而招谤”。火人金多，生活浮散，专好与权势之门辩胜，易引灾祸；火金两强，故多克辩。\n9、火得土多；\n“火得土多，则立用沉密，利害敢为，言清行浊，执不通变”。火人土多，思虑过密，遇利或害，取舍快决，言清实浊，性情固执。火绝得土，土蔽火光，故所适不变利。\n10、火得水多；\n“火得水多，则为德不均，巧而忘礼，多易多难，摭取艰险，计深反害”。水火未济，多智多伤；为人前倨后恭或先卑后慢，计多适多害己，为水火未济之象。\n11、木得木多；", "舍快决，言清实浊，性情固执。火绝得土，土蔽火光，故所适不变利。\n10、火得水多；\n“火得水多，则为德不均，巧而忘礼，多易多难，摭取艰险，计深反害”。水火未济，多智多伤；为人前倨后恭或先卑后慢，计多适多害己，为水火未济之象。\n11、木得木多；\n“木得木多，则柔懦泛交，曲直自循，多学不实，聪明华洁”。木人木多，则宿儒之类，文饰甚佳，而实务不济之士；木主仁柔，色以表形。\n​​12、木得金多；\n“木得金多，则克制憔悴，刚而无断，静思悔动，誉义不常”。木人金多，则为人反复不定，昨日事今日悔，信誉不佳；义胜于仁，反吝于心。\n13、木得土多；\n“木得土多，则取舍自信，华而不奢，体柔伏刚，言必鉴人，智不自胜”。仁轻信过，无礼节也；君子之理也。\n14、木得水多；\n“木得水多，则漂流不定，言行相违，处吉不宁，趋时委曲”。木人水多，心事不定，顺时心不知足，逆时但求实利，不计名节；木华水智，故多顺取。\n15、木得火多；\n“木得火多，则驰骋聪明，好学不切，礼繁义乱，明他害己，善恶决发”。木人火多，则聪明好忙，好礼而不守义，喜揭发人之长短；火得木而炽，木无以自容。\n16、金得金多；\n“金得金多，则刚直尚勇，见义必为，过不自知，忘仁好义，思礼好胜”。金主义，金旺义气必重，此游侠之性格也。金要成器，需要火炼，故思礼。\n17、金得木多；\n“金得木多，则辩分曲直，利害兼资，置德怀忿，朋友失义”。金人木多，得恩易忘，遇忿不忘，有情易失；仁义相伐必有所失。\n18、金得火多；\n“金得火多，则口才辩利，好礼忘义，动止宽和，中心鄙吝”。金人火多，口齿有序，外象宽和，行耻鄙吝；火胜于金，有义礼也。\n19、金得水多；\n“金得水", "怀忿，朋友失义”。金人木多，得恩易忘，遇忿不忘，有情易失；仁义相伐必有所失。\n18、金得火多；\n“金得火多，则口才辩利，好礼忘义，动止宽和，中心鄙吝”。金人火多，口齿有序，外象宽和，行耻鄙吝；火胜于金，有义礼也。\n19、金得水多；\n“金得水多，则计虑不深，为人无恩，临事龌龊，或是或非”。金人水多，为人浮浅，财源不清，多涉是非；水重金藏，多计无刚。\n20、金得土多；\n“金得土多，则失中有成，口俭心慈，作为暗昧，多处嫌疑”。金人土多，则败中见成，心地慈悲，节省不表达心向，常招惹怀疑；金蔽土中，则求之者成。\n21、土得土多；\n“土得土多，则重厚藏密，守信容物，或招毁谤，恩害敢为”。土人土多，为人深厚有信，遇危亦露所知之心情，对人恩怨分明；土虽守信，深厚难知。\n22、土得金多；\n“土得金多，则信而好义，刚而多躁，不能持重，庶事无容”。土人金多，信义均佳，但性情浮躁，气量狭小而非大器；金上争丽，两不自持。\n23、土得木多；\n“土得木多，则形劳志大，杂好狂徒，用柔爽信，曲直党情”。土人木多，凡事多喜亲自过目，好听柔话，信誉不佳，包庇私党；木克土则信亏。\n24、土得火多；\n“土得火多，则施义忘亲，外明少断，奢俭失中，好礼口惠”。土人火多，对外人反优于对亲人，时有不顾妻子三餐之资，而作豪客宴他人，外观明察而少决断。又土得火助，信有所毁。\n25、土得水多；\n“土得水多，则贪功好进，泛顺伏机，志善若昏，爱恶无义”。土人水多，好大喜功，事事皆以功名为先，恩恶只取己之好恶，不依义理；又土虽克水，但水多则土流，主容易因为钱财而失去信用。\n\n十神组合生克论取\n比肩\n比肩对其他十神的克制作用\n比肩克偏财:偏", "土得水多，则贪功好进，泛顺伏机，志善若昏，爱恶无义”。土人水多，好大喜功，事事皆以功名为先，恩恶只取己之好恶，不依义理；又土虽克水，但水多则土流，主容易因为钱财而失去信用。\n\n十神组合生克论取\n比肩\n比肩对其他十神的克制作用\n比肩克偏财:偏财为偏业之财，是透过非正当途径得来的钱财，带有很大的投机性和风险性，而比肩却是与之相互排斥，相互制约的。比肩一般少投机性，少风险性，无非份之想的星。偏财又为父亲，比肩克父，有女人缘(偏财为男性之妾，女友、色欲)，得不到众人之财(偏财为众人之财)，养子之命(偏财为父，父子缘薄)，不图享受，能吃苦耐劳(偏财为物质欲望)，喜欢安静(偏财为动)，身体虚弱(偏财为身体，尤其是在日支上)，色情烦恼。男命不善于言谈，不会刻意迁就别人，懒惰怕动，随时都会有争执的现象。女命则会有对朋友丈夫多疑小心眼，喜欢小题大做，妒忌，会因个性而冒然做出刹那间的决定。\n\n比肩和七杀对冲:七杀是克我之身的(克日主为官杀)，而比肩是帮我之身的，在女性有色情烦恼(七杀为女性之男友，色欲)，冷静固守岗位(七杀是暴而争，坐不住、好动，喜开创)，独断专行。\n\n比肩泄正印:正印之力被泄掉，身子虚弱(正印代表少生病)，多劳(正印代表庇护力)，多言(正印之人不喜欢多说话)，不仁义(正印仁慈)。\n\n比肩生食伤:比肩生食神为排斥之生，生伤官为相吸之生，食神有比肩生之精华不被泄掉:帮助身体(食神是寿无星)，温和(食神性温和)。男命为依附他人之力，若非逼不得已则多是幕后指挥者，如若抛头露面，则容易孤注一掷，女命则为容貌佳好，喜欢孩子，重视于家庭。\n\n劫财\n劫财对其他十神的克制作用\n劫财克正印:劫财与正", "生之精华不被泄掉:帮助身体(食神是寿无星)，温和(食神性温和)。男命为依附他人之力，若非逼不得已则多是幕后指挥者，如若抛头露面，则容易孤注一掷，女命则为容貌佳好，喜欢孩子，重视于家庭。\n\n劫财\n劫财对其他十神的克制作用\n劫财克正印:劫财与正财是阴阳异性相克制相排斥，所以劫财劫的是正财，正财是透过正当途径和手段得到的利益(固定的收入、工资等)，是经过辛勤劳动得到的报酬，而劫财却是透过不正当手段，好逸恶劳，贪赃枉法等手段得到的财源。劫财克正财、破财、克妻，喜欢赌博,好酒色(正财为酒色)，好投机。\n\n劫财与正官对冲:劫财是抗拒正官的管制的，官与劫是阴阳同性相克，相排斥，克的越重，反抗的也越厉害，这和物理上作用与反作用的道理一样的，因为劫财封官的管制非常的反感和对抗，叛逆心理强。劫财旺盛为忌神时，其表现为没有理知，反常规性，盲目性，盲目冲动，蛮不讲理，自以为是，胆大包天，不守礼法，不讲信用，喜欢打架斗殴，女命喜欢争夺别人的丈夫是非多等。\n\n劫财泄偏印:劫财能泄偏印之气，多话，爱吹牛说大话，外表恭顺，内心好门不服气。\n劫财生伤官:表现为高傲，瞒下欺下。\n\n劫财和七杀:劫财喜欢和七杀为伍，因为七杀与劫财是阴阳异性相克，克中带合带吸，劫财之人喜欢被七杀管制，喜欢听七杀的命令，与七杀为伍。他和七杀在一起时体现出勇敢无畏，冒险犯罪，不惜流血牺牲(此类人适合做军人，适合冒险事业)，但容易感情用事，打架斗殴，多事多非。\n\n劫财和偏财:劫财又特别的喜欢偏财，因为劫财和偏财是阴阳异性相克相合，虽然说劫财排斥正财，但却儿喜偏财。偏财代表一种横财，暴发之财，是透过非正当途径和手段获取的利益，因为劫财有爱投机", "人，适合冒险事业)，但容易感情用事，打架斗殴，多事多非。\n\n劫财和偏财:劫财又特别的喜欢偏财，因为劫财和偏财是阴阳异性相克相合，虽然说劫财排斥正财，但却儿喜偏财。偏财代表一种横财，暴发之财，是透过非正当途径和手段获取的利益，因为劫财有爱投机取巧，常存非份之念，爽直豪迈，慷慨大方等特点，也就是所谓的臭味相投吧。易移情别恋，异性缘好等特点。\n\n七杀\n七杀对其他十神的克制作用\n七杀克比肩:急躁，欠思考，猜疑，事业竞争，兄弟不和，女命婚姻烦恼，环境压力。\n\n七杀与食神对冲:暴力，仇恨，厉害，不服输，事业竞争，病痛，争执，天折，权威，志气，专制，多言而惹人忌，厌恶，多言而遭失败。\n\n七杀泄正财:周转失灵，破财，诈骗，事业竞争，急躁。\n\n七杀泄偏财:困惑，色情，失身，残疾，灾难，是非，疑心。\n\n日主自坐七杀:性格谨慎，自尊心强，婚内难体贴对方。\n\n偏财对其他十神的克制作用\n\n偏财克偏印:好动、长寿。\n\n偏财与比肩对冲:不固执，慷慨。\n\n偏财与七杀:风流、好色，敢投机。\n\n偏财泄伤官:不欺骗，坦荡。\n\n食神对其他十神的克制作用\n\n食神克七杀:使杀变得温和，不专制，不偏激，多福气，多寿辰，没有大的灾难，治事精细，胸有谋略。\n\n食神冲偏印:使偏印变得多福多寿，才能能够全部发挥，度量能变得宽宏大量，不孤芳自赏，亲切待人，但性格暴躁，做事马虎。\n\n食神生正偏财:使正偏财的理财能力得以提高，才能提高，能使死财活动、流通起来，能投资及投资后能取得较大的成功，能使人变得好歌舞、好色，执行能力强。\n\n食神泄劫财:使劫财变得不贪赃，细心，精打细算，有思想，有个性，使劫财变得喜幻想，不喜被拘束，好表现。\n\n伤官", "正偏财的理财能力得以提高，才能提高，能使死财活动、流通起来，能投资及投资后能取得较大的成功，能使人变得好歌舞、好色，执行能力强。\n\n食神泄劫财:使劫财变得不贪赃，细心，精打细算，有思想，有个性，使劫财变得喜幻想，不喜被拘束，好表现。\n\n伤官对其他十神的克制作用\n\n伤官克正官:伤官克正官是阴阳同性相克，既相克又排斥。正官是有理法性，常规性，传统性，温和性，公平性，秩序性等特性。而伤官既制之又排斥，反其道而行之，故伤官不喜约事，不服管制，厌恶世俗礼法，豪气壮，胆量大，好胜心强，自由浪漫，求新鲜，一意孤行，任性乖张，以至于触犯法网，招致灾难。\n\n伤官与正印对冲:伤官和正印是阴阳同性相克相斥，正印用仁慈奉献，沈稳理则、淡泊合群来克制伤官的偏激任性，孤傲轻浮，违逆礼法，胆大妄为等劣根性，给伤官以制约和规范，迫使才华的发挥归于正途，督促伤官之人不断地开拓、创新和进取，创造出惊人的成就。伤官与正印对冲之人，有痼疾，劳苦，短命，运动，旅游，说话，着作，气量不大，残暴，刻薄等等特征。\n\n伤官生正偏财:伤官生财是欲望所使，伤官是欲望之星，不管对成就、名誉、地位、财富、性欲等都有一种的强烈的欲望，生财只是为了满足其欲望。伤官生正财是排斥，不是排斥生财,而是能透过排斥谋取财富的途径、方法和手段。食神生正财是透过正当的途径，手段，辛勤劳动得到的财富。而伤官生财则是用聪明才智、胆大创新，机智灵活，非法手段来谋取的财富。偏财他为暴发之财，不正常手段得到的财，伤官与之相生，伤官喜欢用自己的才智、胆大创新、机智灵活，非法手段来谋取的财富。偏财也为暴发之财、不正当手段得到的财、伤官与之相生，伤官喜欢用自己的才智与", "明才智、胆大创新，机智灵活，非法手段来谋取的财富。偏财他为暴发之财，不正常手段得到的财，伤官与之相生，伤官喜欢用自己的才智、胆大创新、机智灵活，非法手段来谋取的财富。偏财也为暴发之财、不正当手段得到的财、伤官与之相生，伤官喜欢用自己的才智与胆量，敢于冒险，敢于投机，为连目的不择手段等特点谋取财富。伤官生财时代表歌舞，理财，才能，才华，多利欲，爱表现，好色，喜欢出风头，口才佳。\n\n伤官泄比肩:好动，遇之不吉，四柱多伤官有子难留，运行伤官运有灾，运行印运方可，运行七杀运家庭起风波，伤官配财印时，必须是一偏一正(如正印、偏财、正财、偏印)，这样它们才能不相战，八字中伤官旺盛无印者多利欲，无财者不发。\n\n正印\n正印对其他十神的克制作用\n正印克伤官:仁慈宽容，寡言，女命子息难成，少病，胆小。\n\n正印和正财对冲:贫，不喜欢赚钱，看淡金钱重名声，欲望不强，克母，反应能力迟钝，内向。\n\n正印泄七杀:七杀经过正印的泄化之后，变得温和，内向，有依赖心，增长寿辰，少病，能逢凶化吉，变的亲切感人。\n\n偏印对其他十神的克制作用\n\n偏印克食神:与六亲无缘，灾难，瘦弱，挑食，无食禄，贫贱，短命。女命难产克子，不温情，才能得不到发挥，妄想。\n\n偏印逢食神:经济上受迫，做事有如无终，多成多败，常会有受制迫做自己不想做的事，娶自己不喜欢的女人为妻，财源有多少破多少，女命则会有产危方面的灾难，母子生离死别。\n\n偏印与正财对冲:不喜欢运动，少言，内向，不喜欢赚钱，没有色欲，偏业不佳，有暗疾，遗传病，孤独，孤僻，养子，贫贱，破财，男有色情之灾。\n\n偏印泄正官:女命指丈夫身体不佳或身子较弱，失识，失官，是非，有心机。", "危方面的灾难，母子生离死别。\n\n偏印与正财对冲:不喜欢运动，少言，内向，不喜欢赚钱，没有色欲，偏业不佳，有暗疾，遗传病，孤独，孤僻，养子，贫贱，破财，男有色情之灾。\n\n偏印泄正官:女命指丈夫身体不佳或身子较弱，失识，失官，是非，有心机。\n\n偏印生比肩:对别人自私而对自己的兄弟姐妹倒是很有帮助。会暗中送钱给他们。\n\n\n阴阳旺衰性情影响\n气禀中和\n“五气不戾，性情中和；浊乱偏枯，性情乖逆”。五气在天，则为元亨利贞；赋在人，则仁、义、礼、智、信之性，恻隐，羞恶，辞让，是非诚实之情。\n五气不戾者，则其存之而为性，发之而为情，莫不中和矣。反此者乖戾。故圣人易艮于东北者，即信以成之之旨也。\n赋于人者，须要五行不戾，中和纯粹，则有恻隐、辞让、诚实之情；若偏枯混浊，太过不及，则有是非、乖逆、骄傲之性矣。\n命中性情，皆由八字先天决定。其性定于命局，虽有岁运调节，只相当于平顺而已，其性仍在；然而，人皆有自主之权，已知己性，可隐忍之，善莫大焉。\n以阴阳分，八字纯阳，其人之性刚而过猛，豪侠慷慨，其处世不苟且，可放而不可收；\n八字纯阴，其人之性柔顺而隐忍，心多深藏；八字阳多阴少，其人外豪迈而内有别藏；\n八字阳少阴多，其人外深沉而内朴实。然此仅一论也，须配合五行气势而论，方而无误。\n以五行分，木主仁、火主礼、土主信、金主义、水主智，配以喜忌则明也，如八字喜木，而木现于四柱，愈旺而愈有仁慈之心；\n若不现于四柱，则少仁慈之心也，如八字忌木，而木现于四柱，愈旺而愈少仁慈之心，若不现于四柱，则反有仁慈之心。他气同于此论。\n以十神分，用食伤者，性格外向，精华外发而多主聪明，有才艺之能，然因其克官杀，而不喜约束，多易", "柱，愈旺而愈有仁慈之心；\n若不现于四柱，则少仁慈之心也，如八字忌木，而木现于四柱，愈旺而愈少仁慈之心，若不现于四柱，则反有仁慈之心。他气同于此论。\n以十神分，用食伤者，性格外向，精华外发而多主聪明，有才艺之能，然因其克官杀，而不喜约束，多易暴躁；\n用印绶者，性格仁爱，恪守道统，写得锦绣文章，因得官杀之生而不免无创新之意；用官杀者，盖身旺也，喜官杀束身，官即管也，故为人能隐忍，有统领之才。\n然性情非定善恶也，实乃思虑行为之模式，须知善恶全凭一己之念，慎之！慎之！以上诸论，皆性情之辩，学命者宜知之。\n1、火烈而性燥者，遇金水之激；\n火炎者，既燥而烈，是木旺火炽之象；此种命造，只宜以湿土（辰土丑土之类），润和之，火得土润，则有泄火之势，其人礼匀而慈爱之德矣；\n苟若以金水激荡之，则火势逾烈，礼之过激，反不知礼，有逾常规，必产生灾祸，有湿土以润，则晦其光，收敛其性，如此火旺益明亮。\n2、水奔而性柔者，全金木之神；\n水者，五行论中其性能制火，其性反柔，惟加其流速，其势奔放，不可阻也，势反强也，至刚且急，若逢火冲之，遇土激之，则逆其性益显其刚，奔放更旺矣。\n若依命理，用金、须顺其势，盖金生水，水泄金也；用木，以疏导其流，而松其淤塞之态，如此从其旺而纳其狂，其性反而柔弱，此谓刚中之德，易进难退。\n水主智，木主仁，金主义，故虽智巧而不失仁义，如此殆可了然。水命性柔，有赖金与木而全其神，而导其势；\n如壬癸日主之命，见金木庚辛甲乙，亦即食伤印枭，反而有用也，可转为智巧多能不失仁义之情，乙庚相化益生日主。\n3、木奔南而软怯；\n五行论中见木一行，己祥其原委，南方运者，丙丁巳午也，木奔南，而生火，火泄木至", "性柔，有赖金与木而全其神，而导其势；\n如壬癸日主之命，见金木庚辛甲乙，亦即食伤印枭，反而有用也，可转为智巧多能不失仁义之情，乙庚相化益生日主。\n3、木奔南而软怯；\n五行论中见木一行，己祥其原委，南方运者，丙丁巳午也，木奔南，而生火，火泄木至甚，所谓泄气太过，若柱中有金，须得水以通畅，则火不烈；\n如无金，须得辰土以收敛火气，方得滋中和，命理中讲求中和，忌偏枯，如此命造，必为人恭敬而有礼貌，温和而中节；\n若无水，则不能济土，土克水，水亦泄土，是相济为用，土能晦火，盖火生土，土亦灭火，如此发泄太过；\n则其人聪明自持，又多变迁不定，难守常态，而成妇人之仁矣。是木命行南方运，要见金水，或金土，乃成谦恭有礼，温和中节之像。\n4、金见水以流通；\n庚辛日主，尤以庚金为然，刚健中正之礼也，能任大事，能决大谋，一见水则流通疏畅，仗义之人，得用其智，是谓气势正直。\n凡金旺之命，见水，其人必显为“内方外园”之气质，既知权变，复不伤廉惠，行藏隐合中庸之道；\n若得气偏者，是金衰水旺也，必作事荒唐，口是心非，有玩弄权术，挟持待人之势，其气不正，其势巧谋，故金命见水要流通舒畅，不可泄气太甚，要金旺不衰，乃合中庸之道礼。\n5、最拗者西水还南；\n西方庚辛申酉之方，水命壬癸子亥之质，用木、则智仁之性行仗义之实，若用土，制之不得其性，反有冲奔之患矣，其性反逆，顽强倔拗。\n既得南方行运，遇到丙丁巳午，必生冲击，水克火，火亦炎水，其势不交融，强拗异常，合无仁礼性。\n6、至刚者东火转北；\n东方之火，乃甲午之命柱，或者丙寅、丙午之命柱，其势转北，必运经壬癸、或子亥，如是火呈木势，其炎上之性；\n不可抵御，绝不宜见水运，只宜顺其", "运，遇到丙丁巳午，必生冲击，水克火，火亦炎水，其势不交融，强拗异常，合无仁礼性。\n6、至刚者东火转北；\n东方之火，乃甲午之命柱，或者丙寅、丙午之命柱，其势转北，必运经壬癸、或子亥，如是火呈木势，其炎上之性；\n不可抵御，绝不宜见水运，只宜顺其刚烈，用湿土以收敛之，乃可化刚烈而变仁慈。\n若转北方之运，运经壬癸，必刚暴更无礼仪，须以土收敛，再行木火之运，乃可顺势，显恻隐忍让之心，故以日柱为中，月时两柱为运，其状可详察。\n由此可知，火性之命，不以水激或行水运为宜，必须赖土以收敛，此为最紧要之诀窍，是宜谨记。\n​​7、顺生之机，遇击神而抗；\n何为顺，何为逆，我生为顺，生我为逆；旺者宜顺，衰者应逆，顺者应顺，逆者应逆，如此以六神四辅衡之，则食伤宜顺，印枭逆逆，顺顺、逆逆，则和平而性顺。\n如木旺得火以通，此谓之顺也。土以行之，生也，不宜见金水之击，木衰，得水以生，反而得顺，金以助水，乃逆中之生，不宜见火土之击；\n我生者食伤也，是谓顺，生我者，印枭也，是谓逆，旺者顺之，宜顺也。衰者逆之，宜逆也。如此，则性情和也。\n若遇相击，旺者则勇急，衰者必懦弱，命格之中，其顺逆得序，乃佳造。苟如性情本和平，至岁运遇击，亦能变为强弱之势，反其常。\n命运不可击，击之有变矣。明其究里，应顺则顺之，应逆则逆之，如此乃有利。\n8、逆生之序，见闲神而狂；\n如木生亥，见戌酉申则气逆，非性之所安，一遇闲神，若巳酉丑逆之，则必发而为狂猛。\n凡命与运，应逆则宜逆，应顺则宜顺，如此，可望性正性和，若木旺，得水生，此即谓之逆。\n再加以金生水，水再生木，是助逆。此时，绝不可见己丑阴土之闲神，木者甲乙寅卯，水者壬癸子亥，己丑则属于闲神", "性之所安，一遇闲神，若巳酉丑逆之，则必发而为狂猛。\n凡命与运，应逆则宜逆，应顺则宜顺，如此，可望性正性和，若木旺，得水生，此即谓之逆。\n再加以金生水，水再生木，是助逆。此时，绝不可见己丑阴土之闲神，木者甲乙寅卯，水者壬癸子亥，己丑则属于闲神，克水泄木。\n若木衰，得火运，泄木盛，此谓逆运，能得土以化，乃逆中之顺，但不可见辰未，辰未为闲神，辰未即土，土泄火耗木。\n此种衰极旺极之势，乃从旺从弱之理，非旺衰得中之意，由此可知，旺极见闲神，必显狂猛，衰极见闲神，必显姑息。\n无论岁运，运道运程即显五行之理，是闲神不可忽，逆生不可见，不可见闲神也。\n9、阳明遇金，郁而多烦；\n凡阳明之气势者，皆畅顺。遇湿土藏金，火不能克金，金不能生水，如此，必成犹郁之气，闷而多烦。\n如此一生得意者少，而失意者多，如此情形，顺得纯行阴浊之运，引通金水之性，方遂所愿。\n10、阳浊藏火，包而多滞；\n酉、丑、亥为阴浊，有火气藏于内，则不发辉而多滞。阴晦之气，本难奋发，如遇湿木藏火，阴气太盛，不能生无焰之火，而成湿滞之患。\n故心欲速而志未逮，临事而模棱少决，所以心性多疑。必须纯行阳明之运，引通木火之气，则豁然而通达矣。\n11、羊刃局，战则逞威，弱则怕事；伤官格，清则谦和，浊则刚猛；\n羊刃局，凡羊刃，如是午火，干头透丙，支又会戌会寅，或得卯以生之，皆旺。透丁为露刃，子冲为战，未合为藏，再逢亥水之克，壬癸水之制，丑辰土之泄，则弱矣。\n伤官格，如支会伤局，干化伤象，不重出，无食混，身旺有财，身弱有印，谓之清，反是则浊。夏木之见水，冬金之得火，清而且秀，富贵非常。\n羊刃局，旺则心高志傲，战则恃势逞威，弱则多疑怕事，合则矫情立异", "再逢亥水之克，壬癸水之制，丑辰土之泄，则弱矣。\n伤官格，如支会伤局，干化伤象，不重出，无食混，身旺有财，身弱有印，谓之清，反是则浊。夏木之见水，冬金之得火，清而且秀，富贵非常。\n羊刃局，旺则心高志傲，战则恃势逞威，弱则多疑怕事，合则矫情立异。如丙日主，以午为羊刃，干透丁火为露刃，支会寅戌，或逢卯生，干透甲乙，或逢丙助，皆谓之旺。\n支逢子为冲，遇亥申为制，得丑辰为泄，干透壬癸为克，逢己土为泄，皆谓之弱。支得未为合，遇巳为帮，则中和矣。\n12、伤官须分真假；\n真者身弱有印，不见财为清；假者身旺有财，不见印为贵。真者，月令伤官，或支会伤局，又透出天干者是也；\n假者，满局比劫，无官星以制之，虽有官星，气力不能敌。柱中不论食神伤官，皆可作用，纵无亦美，只不宜见印，见印破伤为凶。\n凡伤官格，清而得用，为人恭而有礼，和而中节，人才卓越，学问渊深，反此者傲而多骄，刚而无礼以强欺弱，奉势趋利。\n12、用神多者，少恒之志，多迁变之心；\n比如，夏木之见水，必先有金，则水有源；冬金之遇火，须身旺有木，则火有焰，富贵无疑；若夏水无金，冬火无木，清枯之象，名利皆虚也。\n13、时支枯者，狐疑少决，始勤终怠；\n时支为命格之结局，其像至要，在岁运中占重要地位，其像为性向，决定其人一生之所从决，而最终之结果，必以此为定局。\n时支枯萎偏激，必孤疑少决，始勤而终殆也。夏木见水，先应“先有金”，如此则水有源。又为冬金遇火，须得身旺有木，乃克使火有焰，则富贵无疑。\n又如夏水无金，冬火无木，清枯之像，此名利皆虚。其终局如此，人生之尽头，莫可强求。\n\n三刑、自刑性格影响\n三刑：寅巳申、丑未戌\n①寅巳申（无恩之刑）：四柱带有此", "“先有金”，如此则水有源。又为冬金遇火，须得身旺有木，乃克使火有焰，则富贵无疑。\n又如夏水无金，冬火无木，清枯之像，此名利皆虚。其终局如此，人生之尽头，莫可强求。\n\n三刑、自刑性格影响\n三刑：寅巳申、丑未戌\n①寅巳申（无恩之刑）：四柱带有此刑，主为人较为冷酷，寡情薄意，易遭人陷害及恶事发生，常常会忘恩负义，翻脸无情。\n女性逢此刑者，易被嫌弃，别人不领情，无功劳，无人情，爱恨交加，冷酷，寡情薄义\n\n②丑未戌（持势之刑）：聪明反被聪明误，自恃高。性格较为急躁，过于猛进，刚毅自负，自信太高而易遭挫折，及易遭灾祸。\n女性逢此刑者，大多较易陷于孤独或孤寡，自信太高，聪明反被聪明误，急燥，过于猛进，小聪明。\n与十二宫中长生、沐浴、冠带、临官、帝旺同柱者，精神刚毅。\n与十二宫中死绝之字同柱，卑屈或多狡猾，常遭受苦难或招灾疾。\n\n相刑：子刑卯\n①讲话直接，不客气，乃刑中最凶。\n主不孝不悌，相妒不睦，克损六亲，不知礼貌、礼节，没大没小。\n女性带此刑者，外表秀丽品味高，大多与翁姑不合。\n四柱有此刑者，缺乏独立自主，行事有始无终，固执己见，常陷困境。\n②\n\n自刑：辰辰、午午、亥亥、酉酉\n①辰辰：辰五行为土，土有沉埋之气，容易情绪消极，自卑自贱，易患自闭症，无趣于生活，发生自刑后，容易有失望、抑郁或自闭感，还容易有烟瘾、酒瘾或赌瘾之类。\n他们往往怀才不遇，屈服外界的压力，遇到阻力或不顺无力抗争，表面上硬抗，内心却倍感低人一等。\n\n②午午：午五行为火，火有空明之象，发生自刑之后，脾气暴躁，容易酗烟、空想、近视、孤僻、失眠、心率过快等。自尊心强，若过分羞愧，容易抑郁，极端者有自杀倾向。午午自刑丁火旺，见丙", "压力，遇到阻力或不顺无力抗争，表面上硬抗，内心却倍感低人一等。\n\n②午午：午五行为火，火有空明之象，发生自刑之后，脾气暴躁，容易酗烟、空想、近视、孤僻、失眠、心率过快等。自尊心强，若过分羞愧，容易抑郁，极端者有自杀倾向。午午自刑丁火旺，见丙火羊刃显性，午为丁火禄地，宜则礼仪心明，忌则爱钻牛角尖，常常失落暴躁，自尊心较强，脾气暴躁、孤傲不群，爱钻牛角尖，如遇不顺则郁郁寡欢，甚至抑郁，更甚者还有自杀的倾向。原局遇午午自刑者，性格内耗，容易焦虑，脾气急躁\n\n③亥亥：亥五行属水，水能从中，有奔流之象，同时也代表欲望。平时江湖义气称兄道弟，人缘好，过激时容易贪欲过多，纵欲伤身，爱生闷气，有时冷漠自弃。凶时厌世，择偶受扰，总为情困，进而折磨自己，婚姻难以美满，或者有第三者插足，常为情所困。身心不安，缺乏安全感\n\n④酉酉：酉五行为金，金有杀伐之气，又为桃花和欲望，发生自刑后，容易幻想，不切实际，过欲伤身，身弱八字更明显。酉为忌神时，容易冲动，甚至作恶，畏罪潜逃等。酉酉自刑多见气喘、刺青、整容等。命主多欲望强烈，恣情纵欲，行事较为冲动，凶时容易做出违背伦理道德，轻易与人发生冲突，或容易失去理智。遇此自刑之人，易钻牛角尖，较劲，难以脱离思维南墙束缚。不易轻易跳脱原先固化思维而陷入自我纠结中。\n在亲属、社会人际关系中，容易由于争吵，情绪过于激动做出丧失理智的行为，如果酉酉自刑辛金旺，见庚金羊刃显性，金主杀伐果断或行为冲动，吉则刚毅果断，凶则自残损伤。\n⑤桃花带自刑，具有容貌焦虑特性。\n⑥原局带三刑之人，以坐三刑之十神为准，坐三刑的十神是主要三刑性格因素影响之六亲，或事", "十二地支的水火燥湿\n\n子：子中癸水，属纯水，子水为湿。\n\n丑：丑中己土为湿土，辛余为湿金，由于丑中含癸水，故为湿土湿金。\n\n寅：寅中甲木为燥木，戊土为燥土，由于寅中含丙火，故为燥木燥土。\n\n卯：卯为纯木，故无有燥湿之分。\n\n辰：辰中戊土为湿土，乙木为湿木，由于辰土中含癸水，故为湿土湿木。\n\n巳：巳中戊土为燥土，庚金为燥金，由于巳中含丙火，故为燥土燥金。\n\n午：午中己土为燥土，由于午中含丁火，故为燥土。\n\n未：未中己土为燥土，乙木为燥木，由于未藏丁火，故为燥土燥木。\n\n申：申中庚金为湿金，戊土为湿土，由于申中藏壬水，故为湿金湿土。\n\n酉：酉为纯金，故无有燥湿之分。\n\n戌：戌中戊土为燥土，辛为燥金，由于戌中藏丁火，故为燥土燥金。\n\n亥：亥中甲木为湿木，因亥中藏壬水，故为湿木。\n\n从上述可以看出，调候用神取用时，其中寒与热乃是命局中水与火的两种情况，也就是命局中水与火的两种弊病，具体应用时，必须先将命局中是水是火先确定下来，然后再采用寒用热医，热用寒治的医药方法。\n\n寒：指在亥子丑三冬出生的人，四柱中亥子水旺，或丑辰土多，又不见火来暖之，这样的八字谓之寒。属于寒性的八字需采用寒用热医，治疗方法最好用巳午火调候。\n\n热：指在巳午未出生的人，四柱中已午火多，或未戌土多，又不见水来调度，这种八字谓之“热”。热性的八字，用“热用寒治”的方法，最好采用丑辰土，进行泄火调候。\n\n燥：指在未戌月出生，四柱中未戍土多，或巳午火多，又滴水皆无，这种八字谓之“燥”。燥性的八字采用湿治，最好用亥子水进行调候。\n\n湿：指出生于亥子月，四柱中亥子多或丑辰土多，而又不见火者，这种八字谓之“湿”。湿性的八字需采用", "，进行泄火调候。\n\n燥：指在未戌月出生，四柱中未戍土多，或巳午火多，又滴水皆无，这种八字谓之“燥”。燥性的八字采用湿治，最好用亥子水进行调候。\n\n湿：指出生于亥子月，四柱中亥子多或丑辰土多，而又不见火者，这种八字谓之“湿”。湿性的八字需采用“燥”治，治疗方法最好用未戍土进行调候。", "金木水火土之五行调候\n\n甲木日干生，喜用提要：\n寅月--- 丙，癸。 调和气候为要，丙火为主，癸水为佐。\n卯月--- 庚，丙，丁，戊，己。 阳刃架杀，专用庚金，以戊，己滋杀为佐。无庚，用丙，丁泄秀，不取制杀.\n辰月--- 庚，丁，壬。用庚金必须丁火制之，为伤官制杀。无庚用壬。\n巳月--- 癸，庚，丁。调和气候，癸水为主。原局气润，庚丁为用。\n午月--- 癸，庚，丁。木性虚焦，癸为主要，无癸用丁，亦宜运行北地。 木盛先庚，庚盛先丁。\n未月--- 癸，庚，丁。上半月同五月用癸。下半月用庚丁。\n申月--- 庚，丁，壬。伤官制煞，用丙调候，丁丙并用为佐。\n酉月--- 庚，丁，丙。用丁制然，用丙调候，丁丙并用为佐。\n戌月--- 庚，甲，丁，壬，癸。 土旺者用甲木，木旺者用庚金。 丁，壬，癸为佐。\n亥月--- 庚，丁，丙，戊。 用庚金，取丁火制之，丙火调候。 水旺用戊。\n子月--- 丁，庚，丙。木性生寒，丁先庚后，丙火为佐。 必须支见巳，寅，方为贵格。\n丑月--- 丁，庚，丙。 丁火必不可少，通根巳，寅，甲木为助。用庚劈甲引丁。  \n\n乙木日干生，喜用提要：\n寅月--- 丙，癸。取丙火解寒，略取癸水滋润，不宜困丙。火多用癸。\n卯月--- 丙，癸。以癸木，以丙泄秀，不宜见金。\n辰月--- 癸，丙，戊。若支成水局，取戊为佐。\n巳月--- 癸。 月令丙火得禄，专用癸水，调候为急。\n午月--- 癸，丙。上半月专用癸水，下半月丙癸并用。  未月 癸，丙。润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。\n申月--- 丙，癸，己。月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己", "专用癸水，调候为急。\n午月--- 癸，丙。上半月专用癸水，下半月丙癸并用。  未月 癸，丙。润土滋木，喜用癸水，柱多金水，先用丙火。夏月壬癸，切忌戊，己杂乱。\n申月--- 丙，癸，己。月垣庚金司令，取丙火制之，或癸水化之。不论用丙用癸，皆己土为佐。\n酉月--- 癸，丙，丁。上半月癸先丙后，下半月丙先癸后，无癸用壬。支成金局，又宜用丁。\n戌月--- 癸，辛。 以金发水之源。见甲，名藤萝系甲。\n亥月--- 丙，戊。 乙木向阳，专取丙火。水多以戊佐。\n子月--- 丙。寒木向阳，专取丙火，忌见癸水。\n丑月--- 丙。寒谷回春，专用丙火。  \n\n丙火日干生，喜用提要：\n寅月--- 壬，庚。壬水为用，庚金发水之源为佐。\n卯月--- 壬，己。专用壬水，水多用戊制之，身弱用印化之。\n辰月--- 壬，甲。专用壬水，土重以甲为佐。\n巳月--- 壬，癸，庚。以庚为佐，忌戊制壬。无壬用癸。\n午月--- 壬，庚。壬庚以通根申宫为妙。\n未月--- 壬，庚。以庚为佐。 \n申月--- 壬，戊。壬水通根申宫，壬多必取戊制。\n酉月--- 壬，癸。四柱多丙，一壬高透为奇。无壬用癸。\n戌月--- 甲，壬。忌土晦光，先取甲疏土，次用壬水。\n亥月--- 甲，戊，庚，壬。月垣壬水秉令，水旺用甲木化之，身煞两旺，用戊制之。 火旺用壬，木旺宜庚。\n子月--- 壬，戊，己。气进二阳，丙火弱中复强，用壬水，用戊制之。无戊用己。\n丑月--- 壬，甲。喜壬为用，土多不可少甲。  \n\n丁火日干生，喜用提要：\n寅月--- 甲，庚。 用庚金劈甲引丁。 卯月 庚，甲。 以庚去乙，以甲引丁。\n辰月--- 甲，庚。 用甲木引丁制土，次看庚金。\n巳", "强，用壬水，用戊制之。无戊用己。\n丑月--- 壬，甲。喜壬为用，土多不可少甲。  \n\n丁火日干生，喜用提要：\n寅月--- 甲，庚。 用庚金劈甲引丁。 卯月 庚，甲。 以庚去乙，以甲引丁。\n辰月--- 甲，庚。 用甲木引丁制土，次看庚金。\n巳月--- 甲，庚。 取甲引丁，甲多又取庚为先。\n午月--- 壬，庚，癸。 火多以庚壬两透为贵。无壬用癸，为独煞当权。\n未月--- 甲，壬，庚。 以甲木化壬引丁为用，用甲不能无庚，取庚为佐。\n申月--- 甲，庚， 丙，戊。 取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊。\n酉月--- 甲，庚， 丙，戊。 取庚劈甲，无甲用乙。用丙暖金晒甲，无庚甲而用乙者，见丙为枯草引灯。水旺用戊。\n戌月--- 甲，庚，戊。 一派戊土无甲，为伤官伤尽。\n亥月--- 甲，庚。 庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用。\n子月--- 甲，庚。 庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用。\n丑月--- 甲，庚。 庚金劈甲引丁，甲木为尊，庚金为佐，戊癸权宜酌用。  \n\n戊土日干生，喜用提要：\n寅月--- 丙，甲，癸。 无丙照暖，戊土不生，无甲疏劈，戊土不灵。 无癸滋润，万物不长，先丙，次甲，次癸。\n卯月--- 丙，甲，癸。 无丙照暖，戊土不生，无甲疏劈，戊土不灵。 无癸滋润，万物不长，先丙，次甲，次癸。 \n辰月--- 甲，丙，癸。 戊土司令，先用甲疏，次丙，次癸。\n巳月--- 甲，丙，癸。 戊土建禄，先用甲疏劈，次取丙癸。\n午月--- 壬，甲，丙。 调候为急，先用壬水，次取甲木，丙火配用。\n未月--- 癸，丙，甲。 调候为急，癸不可缺", "癸。 \n辰月--- 甲，丙，癸。 戊土司令，先用甲疏，次丙，次癸。\n巳月--- 甲，丙，癸。 戊土建禄，先用甲疏劈，次取丙癸。\n午月--- 壬，甲，丙。 调候为急，先用壬水，次取甲木，丙火配用。\n未月--- 癸，丙，甲。 调候为急，癸不可缺，丙火配用。土重不能无甲。\n申月--- 丙，癸，甲。 寒气渐增，先用丙火。水多，用甲泄之。\n酉月--- 丙，癸。 赖丙照暖，喜水滋润。\n戌月--- 甲，丙，癸。 戊土当权，先用甲木，次取丙火。 见金，先用癸水，后取丙火。\n亥月--- 甲，丙。 非甲不灵，非丙不暖。\n子月--- 丙，甲。 丙火为尚，甲木为佐。\n丑月--- 丙，甲。 丙火为尚，甲木为佐。\n\n己土日干生，喜用提要：\n寅月--- 丙，庚，甲。取丙解寒，忌见壬水，如水多，须以戊土为佐。土多用甲，甲多用庚。\n卯月--- 甲，癸，丙。 用甲忌与己土合化，次用癸水润之。\n辰月--- 丙，癸，甲。 先丙后癸，土暖而润，随用甲疏。\n巳月--- 癸，丙。调候不能无癸，土润不能无丙。\n午月--- 癸，丙。调候不能无癸，土润不能无丙。\n未月--- 癸，丙。调候不能无癸，土润不能无丙。\n申月--- 丙，癸。丙火温土，癸水润土，七月庚金司权，丙能制金，癸以泄金。\n酉月--- 丙，癸。取辛辅癸。\n戌月--- 甲，丙，癸。九月土盛，宜甲木疏之，次用丙癸。\n亥月--- 丙，甲，戊。三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。\n子月--- 丙，甲，戊。三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。\n丑月--- 丙，甲，戊。三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。", "，戊。三冬己土，非丙暖不生。初冬壬旺，取戊土制之，土多，取甲木疏之。\n子月--- 丙，甲，戊。三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。\n丑月--- 丙，甲，戊。三冬己土非丙暖不生。壬水太旺，取戊土制之，土多，取甲木疏之。 \n\n庚金日干生，喜用提要：\n寅月--- 戊，甲，壬， 丙，丁。 用丙暖庚性，虑土厚埋金，须甲疏泄。 火多用土，支成火局用壬。\n卯月--- 丁，甲，庚， 丙。 庚金暗强，专用丁火，借甲引丁，用庚劈甲。 无丁用丙。\n辰月--- 甲，丁，壬， 癸。 顽金宜丁，旺土用甲，不用庚劈。 支火宜癸，干火宜壬。\n巳月--- 壬，戊，丙， 丁。 丙不 金，惟喜壬制，次取戊土，丙火为佐。 支成金局，变弱为强，须用丁火。\n午月--- 壬，癸。专用壬水，癸次之，须支见庚辛为助。无壬，癸，用戊，己泄火之气。\n未月--- 丁，甲。若支会土局，甲先丁后。\n申月--- 丁，甲。专用丁火，甲木引丁。酉月丁，甲，丙。用丁甲 金，兼用丙火调候。\n戌月--- 甲，壬。土厚先用甲疏，次用壬洗。\n亥月--- 丁，丙。水冷金寒爱丙丁，甲木辅丁。\n子月--- 丁，甲，丙。仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。 丙丁须临寅巳午未戌支，方为有力。\n丑月--- 丙，丁，甲。仍取丁甲，次取丙火照暖，一派金水，不入和暖之乡，孤贫。 丙丁须临寅巳午未戌支，方为有力。  \n\n辛金日干生，喜用提要：\n寅月--- 己，壬，庚。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。\n卯月--- 壬，甲。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人", "未戌支，方为有力。  \n\n辛金日干生，喜用提要：\n寅月--- 己，壬，庚。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。\n卯月--- 壬，甲。辛金失令，取己土为生身之，本欲得辛金发用，全赖壬水之功。壬己并用，人庚为助。\n辰月--- 壬，甲。若见丙火合辛，须有癸制丙，支见亥子申，为贵。\n巳月--- 壬，甲，癸。壬水洗淘，兼有调候之用，更有甲木制戊，一清澈底。\n午月--- 壬，己，癸。己无壬不湿，辛无巳不生，故壬，巳并用。无壬用癸。\n未月--- 壬，庚，甲。先用壬水，取庚为佐，忌戊出，得甲制之，方吉。\n申月--- 壬，甲，戊。壬水为，甲戊酌用。不可用癸水。\n酉月--- 壬，甲。壬水淘洗，如见戊己，须甲制土，支成金局无壬须用丁火。\n戌月--- 壬，甲。月辛金，火土为病，水木为药。\n亥月--- 壬，先壬后丙，名金白水清，馀皆酌用。\n子月--- 丙，戊，壬，申。冬月辛金，不能缺丙火温暖，馀皆酌用。\n丑月--- 壬，戊，己。同上，壬先，戊己次之，总之，丙火不可少也。  \n\n壬水日干生，喜用提要：\n寅月--- 庚，丙，戊。 无比劫者，不必用戊，专用庚金，以丙为佐。如比劫多，又宜制之，一戊出，名一将当关，群邪自伏。\n卯月--- 戊，辛，庚。 三春壬水绝地，取庚，辛发水之源。水多用戊。\n辰月--- 甲，庚。 甲疏季上，次取庚金发水源，金多预丙制之为妙。\n巳月--- 壬，辛 庚，癸。壬水弱极，取庚，辛为源，壬癸比劫。\n午月--- 癸，庚，辛。取庚为源，取癸为佐。无庚用辛。\n未月--- 辛，甲。以辛金发水源，甲木疏土。\n申月--- 戊，丁。取丁火佐戊制庚，戊土通根辰戌，", "源，金多预丙制之为妙。\n巳月--- 壬，辛 庚，癸。壬水弱极，取庚，辛为源，壬癸比劫。\n午月--- 癸，庚，辛。取庚为源，取癸为佐。无庚用辛。\n未月--- 辛，甲。以辛金发水源，甲木疏土。\n申月--- 戊，丁。取丁火佐戊制庚，戊土通根辰戌，丁火通根午戌，方可为用。\n酉月--- 甲，庚。无甲，用金发水之源，名独水犯庚辛，体全之义。\n戌月--- 甲，丙。以甲制戌中戊土，丙火为佐。\n亥月--- 戊，丙，庚。如甲出制戊，须以庚金为救。\n子月--- 戊，丙。水旺宜戊，调候宜丙，丙戊必须兼用。\n丑月--- 丙，丁，甲。 上半月专用丙火，下半月用丙，甲木为佐。  \n\n癸水日干生，喜用提要：\n寅月--- 辛，丙。 用辛生癸水为源，无辛用庚，丙不可少。\n卯月--- 庚，辛。 乙木司令，专用庚金，辛金次之。\n辰月--- 丙，辛，甲。 上半月专用丙火，下半月虽用丙火，辛甲为佐。\n巳月--- 辛。 无辛用庚。\n午月--- 庚，辛， 壬，癸。 庚辛为生身之本，但丁火司权，金难敌火，宜兼用比劫，方得庚辛之用。\n未月--- 庚，辛， 壬，癸。 上半月金神衰弱，火气炎热，宜比劫帮身，同五月。 下半月无比劫亦可。\n申月--- 丁。 庚金得禄，必丁火制金为用，丁火以通根午戌未为妙。\n酉月--- 辛，丙。 辛金为用，丙火佐之，名水暖金温，须隔位同透。\n戌月--- 辛，甲， 壬，癸。 专用辛金，忌戊土，要比劫滋甲，制戊为妙。\n亥月--- 庚，辛， 戊，丁。 亥中甲木长生，泄散元神，宜用庚，辛。 水多用戊，金多用丁。\n子月--- 丙，辛。 丙火解冻，辛金滋扶。\n丑月--- 丙，丁。 丙火解冻，通根寅巳午未戌，方妙，癸巳", "。 专用辛金，忌戊土，要比劫滋甲，制戊为妙。\n亥月--- 庚，辛， 戊，丁。 亥中甲木长生，泄散元神，宜用庚，辛。 水多用戊，金多用丁。\n子月--- 丙，辛。 丙火解冻，辛金滋扶。\n丑月--- 丙，丁。 丙火解冻，通根寅巳午未戌，方妙，癸巳会党，年透丁火，名雪后灯光，夜生者贵。支成火局， 又宜用庚辛。\n\n甲日干生\n寅月：丙火为主，癸水为佐。\n卯月：专用庚金，无庚用丙、丁。\n辰月：用庚必须有丁，无庚用壬。\n巳月：癸为主，次丁、庚。\n午月：无癸用丁，木多者取庚。\n未月：上半月用癸，下半月取庚、丁。\n申月：先庚后丁、壬。\n酉月：庚为主，丙、丁调候。\n戌月：木多用庚，土多用甲。\n亥月：用庚、丁、丙，木多用甲。\n子月：丁先庚、丙后。\n丑月：丁为必须，次庚丙，通寅巳佳。\n\n乙日干生\n寅月：丙为主，癸略取则足。\n卯月：丙为主，癸略取则足。忌强金。\n辰月：癸、丙，水强用戊。\n巳月：专用癸水调候。\n午月：上半月癸，下半月丙癸兼用。\n未月：用癸，金水多取丙泄，己土制。\n申月：有庚取丙克癸泄，取己土为佐。\n酉月：上半月癸先丙，下丙先癸，丁。\n戌月：先癸后辛。\n亥月：专取丙用，水多兼用戊。\n子月：专用丙火。\n丑月：寒木专用丙火。\n\n丙日干生\n寅月：壬水为主，庚为佐。\n卯月：先壬后己。\n辰月：专用壬水，土厚以甲为佐。\n巳月：先壬，次庚、癸。\n午月：用壬、庚，通申者佳。\n未月：用壬、庚，通申者佳。\n申月：用壬，水多取戊制。\n酉月：四柱丙多，壬为奇，无壬用癸。\n戌月：忌土厚，甲先壬后。\n亥月：用甲、壬、庚、戊。\n子月：用壬，水多以戊、己制。\n丑月：用壬，土多取甲制。\n\n丁日干生\n寅月：用甲必须兼用庚金。\n卯", "未月：用壬、庚，通申者佳。\n申月：用壬，水多取戊制。\n酉月：四柱丙多，壬为奇，无壬用癸。\n戌月：忌土厚，甲先壬后。\n亥月：用甲、壬、庚、戊。\n子月：用壬，水多以戊、己制。\n丑月：用壬，土多取甲制。\n\n丁日干生\n寅月：用甲必须兼用庚金。\n卯月：庚、乙，无乙用甲。\n辰月：甲，木盛取庚，水众用戊。\n巳月：用甲、庚，木多取庚先。\n午月：用壬、庚、癸。\n未月：甲、壬、庚，用甲不可缺庚。\n申月：甲、庚、丙，有巳直取巳为用。\n酉月：用甲、庚、丙、戊。\n戌月：用甲、庚、丙、戊。\n亥月：甲为主，庚为佐，戊、癸酌取。\n子月：甲为主，庚为佐，戊、癸酌取。\n丑月：甲为主，庚为佐，戊、癸酌取。\n\n戊日干生\n寅月：先丙次甲、癸，三者不可缺一。\n卯月：先丙次甲、癸，三者不可缺一。\n辰月：土正当令，先甲次丙、癸。\n巳月：先甲次丙、癸。\n午月：调候为上，先壬次甲、丙。\n未月：癸水优先，次丙、甲。\n申月：丙、癸、甲，土多用甲不可癸。\n酉月：丙为主，癸为佐。\n戌月：甲、丙、癸，有金局者，癸先。\n亥月：甲、丙，二者不可缺一。\n子月：丙为主，甲佐之。\n丑月：丙为主，甲佐之。\n\n己日干生\n寅月：丙庚甲，若水成局，兼用戊土。\n卯月：甲、丙、癸，忌甲己合土。\n辰月：丙、癸、甲，土多甲优先。\n巳月：癸为主，丙佐之。\n午月：癸为主，丙佐之。\n未月：癸为主，丙佐之。\n申月：丙、癸，庚金当令，须丙火制。\n酉月：丙、癸，酌取辛金。\n戌月：甲、丙、癸，甲、丙用以扶抑。\n亥月：丙、甲，水旺兼用戊。\n子月：丙、甲，水旺兼用戊。\n丑月：丙、甲，水旺兼用戊。\n\n庚日干生\n寅月：戊、甲、丙，火多用壬。\n卯月：丁、甲、庚，无丁可取丙。\n辰月：甲、", "丙火制。\n酉月：丙、癸，酌取辛金。\n戌月：甲、丙、癸，甲、丙用以扶抑。\n亥月：丙、甲，水旺兼用戊。\n子月：丙、甲，水旺兼用戊。\n丑月：丙、甲，水旺兼用戊。\n\n庚日干生\n寅月：戊、甲、丙，火多用壬。\n卯月：丁、甲、庚，无丁可取丙。\n辰月：甲、丁，干火旺用壬，支用癸。\n巳月：用壬、丙、丁、戊。\n午月：壬、癸，火旺也可用戊、己。\n未月：丁、甲，成土局则甲先丁后。\n申月：丁、甲，专用丁，无甲可用乙。\n酉月：丁、甲，支中略取丙火。\n戌月：甲、壬，用壬忌见己土。\n亥月：用丁、丙。\n子月：丁、甲、丙，丙不可缺。\n丑月：丁、甲、丙，丙不可缺。\n\n辛日干生\n寅月：已优先，次壬、庚。\n卯月：用壬、甲，忌丁透干。\n辰月：壬、甲，若丙辛合，兼用丙。\n巳月：壬、甲、癸，无戊为上格。\n午月：壬、已、癸，壬不宜旺，忌丁。\n未月：壬、庚、甲，忌土旺。\n申月：壬为主，次甲、戊，不忌癸水。\n酉月：壬，土盛甲先，金旺兼用丁。\n戌月：壬、甲，畏火旺。\n亥月：用壬、丙，金清水白之格。\n子月：用丙，戊、壬、甲酌用。\n丑月：用丙，戊、壬、己酌用。\n\n壬日干生\n寅月：庚、丙，比劫重戊为先。\n卯月：戊为主，次辛、庚。\n辰月：甲、庚，金多兼用丙。\n巳月：用壬、辛、庚、癸。\n午月：癸、庚、辛，忌丁透干。\n未月：辛、甲，土多甲先辛后。\n申月：戊、丁，二者必须有根。\n酉月：用甲、癸，水只需一位。\n戌月：甲、丙、戊，有合者，丙先甲。\n亥月：戊、丙，木成局者，庚优先。\n子月：戊、丙，二者不可缺一。\n丑月：上半月丙先，下半月丁甲并用。\n\n癸日干生\n寅月：辛、丙，用庚者，须丙庚均势。\n卯月：庚、辛、乙，有合庚则庚先。\n辰月：上半月用丙，下半月", "月：甲、丙、戊，有合者，丙先甲。\n亥月：戊、丙，木成局者，庚优先。\n子月：戊、丙，二者不可缺一。\n丑月：上半月丙先，下半月丁甲并用。\n\n癸日干生\n寅月：辛、丙，用庚者，须丙庚均势。\n卯月：庚、辛、乙，有合庚则庚先。\n辰月：上半月用丙，下半月辛甲并用。\n巳月：辛，无辛用庚。\n午月：庚、辛、癸，不可见强力之丁。\n未月：庚、辛、癸，不可见强力之丁。\n申月：用丁，成金局者，丁须有根。\n酉月：辛、丙，二全者水暖金温。\n戌月：辛、甲、癸、壬，忌土盛。\n亥月：庚、辛，水多用戊，金多取丁。\n子月：庚、辛，水多用戊，金多取丁。\n丑月：丙、丁，火成局，须庚辛。\n\n一、寒暖\n阴支为寒，阳支为暖；西北为寒，东南为暖；金水为寒，木火为暖。如果八字偏寒或偏暖都属于偏枯之象，八字层次不会太高，但是如果八字太寒，大运中遇暖气，则遇暖而发，正所谓：得气之寒，遇暖而发；得气之暖，逢寒而成。\n寒暖有以下特点：\n1、 五行为寒，遇暖就可升发；五行为暖，遇寒就可成功\n2、 寒虽至极，如果含有暖气；或者暖虽至甚，如果寒气有根，那么大运中遇见补寒暖的地方，就可以生发\n3、 寒至极暖无根，暖至甚寒无气，谓之孤寡，则没有生发之机\n4、 过于寒者，反义无暖为美；过于暖者，反义无寒为妙\n\n二、燥湿\n燥湿者，水火相成之谓也，故主有主气，内不秘乎五行；局有局气，外必贯乎四柱，湿为阴气，当逢燥而成；燥为阳气，当遇湿而生。是以木生夏令，精华发泄，外有余而内实虚脱，必藉壬癸以生之，丑辰湿土以培之，则火不烈，木不枯，土不燥，水不涸，而有生成之义矣，若见未戌燥土，反助火而不能晦火，纵有水，亦不能为力也。慛金百炼，不易其色，故金生冬令，虽然泄气休", "为阳气，当遇湿而生。是以木生夏令，精华发泄，外有余而内实虚脱，必藉壬癸以生之，丑辰湿土以培之，则火不烈，木不枯，土不燥，水不涸，而有生成之义矣，若见未戌燥土，反助火而不能晦火，纵有水，亦不能为力也。慛金百炼，不易其色，故金生冬令，虽然泄气休囚，竟可用丙丁若见丑辰湿土，反助水而不能制水，纵有火，亦不能为力也。此地道生成之妙理也。\n燥湿的实质就是水火二气，天干金水为湿，木火为燥；地支西北为湿，东南为燥。秋冬为湿，春夏为燥。寅卯巳午未戌，为暖燥之乡；辰申酉亥子丑为寒湿之地。暖阳地支之上有甲乙丙丁戊，则暖而近于燥；阴寒地支上有己庚辛壬癸，则寒而流于湿。\n\n算命只是预测的一种手段，而不是真真正正看到未来了，算命得到的信息，只能作为人生决策的参考，而不能作为行为指标。"], "sources": [{"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge1.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge2.docx"}, {"file": "knowladge3.txt"}, {"file": "knowladge3.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}, {"file": "knowladge4.txt"}]}